[
  {
    "id": "1460335437062082684",
    "meta": {
      "created_at": "2026-01-12T18:11:39.916000+00:00",
      "start_timestamp": "2024-01-14T06:00:00+00:00",
      "display_time": "14. Jan 2024",
      "title_en": "Update 14. Jan 2024",
      "title_de": "Update vom 14. Jan 2024",
      "title_cn": "更新 14. Jan 2024",
      "title_ru": "Обновление 14. Jan 2024",
      "image_url": ""
    },
    "en": {
      "data": {
        "major": [
          "Epic progression expansion! New Dragon Crystal buildings, Dragon Crystal research, and a new Troop Tier are coming soon. Be the first to seize the Dragon Crystals and dominate the Viking Age! ※ To unlock, Kingdom must have entered the Conquest Season \"Fenrir's Judgment\" and the Academy must be Level 25.",
          "Shrine Ritual event coming soon. As the polar night blankets the North, the ancient altars stir once more. Arise, Viking warriors! Ignite the fires of the shrine!"
        ],
        "new_features": [
          "New \"Wishing Orb\" event. Let the Wishing Orb light your path to conquest!",
          "Main Quest chapters have been extended to Chapter 35, featuring new quests related to Dragon Crystals.",
          "New \"Dragon Crystal Legend\" event. Complete quests for a chance to trigger the \"Giant Dragon's Blessing\", granting massive discounts or enhanced pack rewards. Triggers upon completing and claiming rewards for Chapter 33.",
          "New \"Kingdom Mayhem\" Conquest Season event, \"Odin's Summon\". Use \"Chaos Badges\" to exchange for current-season Skills, Heroes, and other items to bolster your Kingdom's war efforts. ※ This event opens during the endless battle phase following the \"Fenrir's Judgment\" season. Donating items during the event grants a chance to obtain [Sx Campaign Choice Chests], which can be exchanged for Chaos Badges. After this update, the event will also sync for Kingdoms currently in the endless battle phase of the \"Kingdom Mayhem\".",
          "2025 \"Flaming Sacrifice\" series of events and Skins is returning!",
          "The initial download size has been reduced. Additional resources will now download automatically after entering the game. ※ Resources will download only over Wi-Fi, and downloads will automatically pause when using mobile data."
        ],
        "optimizations": [
          {
            "title": "General",
            "items": [
              "Reduced the Migration Pass Consumption for Strong and Common Kingdoms at certain Might brackets.",
              "Optimized the city management experience by removing \"Monster Cave\" quests and gameplay, and reducing the total number of Enemy Extermination stages.",
              "Optimized difficulty for \"Tribe Trial\" by reducing the difficulty for Levels 20-25 and added Levels 26-30 challenges.",
              "Added filter feature for Troop creation to quickly locate target Heroes.",
              "Optimized the difficulty scaling and rewards for the \"Sworn Vengeance\" and \"Hero Redemption\" events upon entering the Conquest Season.",
              "Optimized the recycling conditions for \"Monster Essence\", \"Thorny Spike\", \"War Horn\", \"Construction Speedup\", and \"Research Speedup\".",
              "Optimized the interaction for Mount Honing and Skill Drawing. A Quick Hone button has been added to the honing interface.",
              "Optimized the interaction logic for the Academy, Infirmary, Smithy, and Barracks. Research, healing, crafting, and training can now be performed while the buildings are being upgraded.",
              "Troop presets can now be used at the Arena and Manor.",
              "Optimized the notification for Skin Shop and added new weekly free rewards.",
              "Optimized the reminders for Ranking selection rewards.",
              "Optimized the prize animation and probability descriptions for \"Tribe Day Treasure Hunt\".",
              "Optimized the \"Hall of Valor\" drawing experience.",
              "Optimized the trigger conditions for \"Rage\" Skills."
            ]
          },
          {
            "title": "Kingdom Mayhem Endless Battle event",
            "items": [
              "Donating items during the event now grants a chance to receive reward selection chests.",
              "Increased Chief Ranking rewards for donations during the Conquest Seasons, \"Fenrir's Judgment\" - \"Surtr's Flames\"."
            ]
          },
          {
            "title": "Contents of various events and packs to include new Dragon Crystal materials",
            "items": [
              "For Conquest Seasons \"Baldr's Redemption\" - \"Surtr's Flames\", Heroes and Skills from the previous season have been added to the Exchange Shop.",
              "For Conquest Seasons \"Fenrir's Judgment\" - \"Surtr's Flames\", \"Dragon Crystals\" have been added to the War Merit Shop, Occupation Achievements, and Chief/Team Ranking rewards. The quantities for \"Yggdrasil Dew\", \"Sx Hero Shard\", \"Blue Chalcedony\", and \"Honing Fruit\" have been adjusted.",
              "Added \"Dragon Crystals\" to \"Eternal Wheel\" and other main features and packs."
            ]
          },
          {
            "title": "Blood Oath War series",
            "items": [
              "Map and Interaction: Reduced map size for faster combat encounters and reinforcements.",
              "Permission Management: R4 and higher members who enter the battlefield now automatically receive commander permissions, including setting/removing Bookmarks, and casting Legion Skills."
            ]
          }
        ],
        "fixes": [
          "Fixed the Tribe Shop \"Shard Market\" issue where certain items could not be gifted.",
          "Fixed the \"Dragon Taming Journey\" issue where event quests occasionally fail to refresh in time.",
          "Fixed the issue where the status of the \"Kingdom Mayhem-Surtr's Flames\" survey icon did not update immediately.",
          "Fixed the abnormal Kingdom Might fluctuation issue in migration events.",
          "Fixed the visual effect issue when obtaining Legendary-grade rewards from the Wheel of Fortune.",
          "Fixed the issue where the assists were not being recorded in the Tribe Assist Ranking.",
          "Fixed the display issue of Wounded Troop data that could occur in \"Pillage Weston\".",
          "Fixed the issue where sending Emotes while multiple Troops were selected prevented the pop-up window from closing.",
          "Fixed the issue that prevented the auto-attack setting from being applied to \"Beast Lairs\" in \"Kingdom Mayhem\"."
        ]
      }
    },
    "de": {
      "data": {
        "major": [
          "Epische Fortschrittserweiterung! Neue Dragon Crystal Gebäude, Dragon Crystal Forschung und eine neue Truppenstufe kommen bald. Seid die Ersten, die die Dragon Crystals erobern und das Wikingerzeitalter dominieren! ※ Zur Freischaltung muss das Königreich die Eroberungssaison \"Fenrir's Judgment\" erreicht haben und die Academy muss Stufe 25 sein.",
          "Schrein-Ritual-Event kommt bald. Während die Polarnacht den Norden bedeckt, regen sich die alten Altäre wieder. Erhebt euch, Wikingerkrieger! Entzündet die Feuer des Schreins!"
        ],
        "new_features": [
          "Neues \"Wishing Orb\"-Event. Lasst den Wishing Orb euren Weg zur Eroberung erleuchten!",
          "Die Hauptquest-Kapitel wurden bis Kapitel 35 erweitert und enthalten neue Quests im Zusammenhang mit Dragon Crystals.",
          "Neues Event \"Dragon Crystal Legend\". Schließe Quests ab, um die \"Giant Dragon's Blessing\" auszulösen, die massive Rabatte oder verbesserte Paketbelohnungen gewähren. Wird beim Abschließen und Beanspruchen von Belohnungen für Kapitel 33 ausgelöst.",
          "Neues Eroberungssaison-Event \"Kingdom Mayhem\", \"Odin's Summon\". Verwende \"Chaos Badges\", um sie gegen aktuelle Saison-Skills, Helden und andere Gegenstände einzutauschen, um die Kriegsanstrengungen deines Königreichs zu stärken. ※ Dieses Event beginnt während der Endlosschlachtphase nach der Saison \"Fenrir's Judgment\". Das Spenden von Gegenständen während des Events gewährt die Chance, [Sx Kampagnen-Auswahlkisten] zu erhalten, die gegen Chaos Badges eingetauscht werden können. Nach diesem Update wird das Event auch für Königreiche synchronisiert, die sich derzeit in der Endlosschlachtphase des \"Kingdom Mayhem\" befinden.",
          "Die Event- und Skin-Reihe \"Flaming Sacrifice\" 2025 kehrt zurück!",
          "Die anfängliche Downloadgröße wurde reduziert. Zusätzliche Ressourcen werden nun automatisch nach dem Betreten des Spiels heruntergeladen. ※ Ressourcen werden nur über WLAN heruntergeladen, und Downloads pausieren automatisch bei Verwendung mobiler Daten."
        ],
        "optimizations": [
          {
            "title": "Allgemein",
            "items": [
              "Reduzierter Verbrauch von Migrationspässen für starke und gewöhnliche Königreiche in bestimmten Machtbereichen.",
              "Optimierte Stadterfahrung durch Entfernung von \"Monster Cave\"-Quests und Gameplay sowie Reduzierung der Gesamtzahl der Feindesvernichtungs-Stufen.",
              "Optimierte Schwierigkeit für \"Tribe Trial\" durch Reduzierung der Schwierigkeit für Stufen 20-25 und Hinzufügen von Herausforderungen für Stufen 26-30.",
              "Filterfunktion zur Truppenerstellung hinzugefügt, um Ziel-Helden schnell zu finden.",
              "Optimierte Schwierigkeitsskalierung und Belohnungen für die Events \"Sworn Vengeance\" und \"Hero Redemption\" beim Betreten der Eroberungssaison.",
              "Optimierte Recycling-Bedingungen für \"Monster Essence\", \"Thorny Spike\", \"War Horn\", \"Construction Speedup\" und \"Research Speedup\".",
              "Optimierte Interaktion für Mount Honing und Skill Drawing. Ein Schnelles-Veredeln-Knopf wurde zur Veredelungsoberfläche hinzugefügt.",
              "Optimierte Interaktionslogik für die Academy, Infirmary, Smithy und Barracks. Forschung, Heilung, Handwerk und Training können jetzt durchgeführt werden, während die Gebäude aufgerüstet werden.",
              "Truppenvoreinstellungen können jetzt in der Arena und im Manor verwendet werden.",
              "Optimierte Benachrichtigung für den Skin Shop und neue wöchentliche kostenlose Belohnungen hinzugefügt.",
              "Optimierte Erinnerungen für Ranking-Auswahlbelohnungen.",
              "Optimierte Preisanimation und Wahrscheinlichkeitsbeschreibungen für \"Tribe Day Treasure Hunt\".",
              "Optimierte Zeichenerfahrung im \"Hall of Valor\".",
              "Optimierte Auslösebedingungen für \"Rage\" Skills."
            ]
          },
          {
            "title": "Kingdom Mayhem Endlosschlacht-Event",
            "items": [
              "Das Spenden von Gegenständen während des Events gewährt jetzt die Chance, Belohnungs-Auswahlkisten zu erhalten.",
              "Erhöhte Chief Ranking Belohnungen für Spenden während der Eroberungssaisons \"Fenrir's Judgment\" - \"Surtr's Flames\"."
            ]
          },
          {
            "title": "Inhalte verschiedener Events und Pakete, die neue Dragon Crystal Materialien enthalten",
            "items": [
              "Für die Eroberungssaisons \"Baldr's Redemption\" - \"Surtr's Flames\" wurden Helden und Skills aus der vorherigen Saison dem Tauschladen hinzugefügt.",
              "Für die Eroberungssaisons \"Fenrir's Judgment\" - \"Surtr's Flames\" wurden \"Dragon Crystals\" dem Kriegsverdienstladen, den Besatzungserfolgen und den Chief/Team Ranking Belohnungen hinzugefügt. Die Mengen für \"Yggdrasil Dew\", \"Sx Hero Shard\", \"Blue Chalcedony\" und \"Honing Fruit\" wurden angepasst.",
              "Dragon Crystals wurden dem \"Eternal Wheel\" und anderen Hauptfunktionen und Paketen hinzugefügt."
            ]
          },
          {
            "title": "Blood Oath Kriegsreihe",
            "items": [
              "Karte und Interaktion: Reduzierte Kartengröße für schnellere Kampfbegegnungen und Verstärkungen.",
              "Berechtigungsverwaltung: R4 und höherrangige Mitglieder, die das Schlachtfeld betreten, erhalten jetzt automatisch Kommandantenberechtigungen, einschließlich dem Setzen/Entfernen von Lesezeichen und dem Wirken von Legion Skills."
            ]
          }
        ],
        "fixes": [
          "Problem im Tribe Shop \"Shard Market\" behoben, bei dem bestimmte Gegenstände nicht verschenkt werden konnten.",
          "Problem in der \"Dragon Taming Journey\" behoben, bei dem Event-Quests gelegentlich nicht rechtzeitig aktualisiert wurden.",
          "Problem behoben, bei dem der Status des Umfragesymbols von \"Kingdom Mayhem-Surtr's Flames\" nicht sofort aktualisiert wurde.",
          "Problem der abnormalen Königreichsmachtschwankung bei Migrationsereignissen behoben.",
          "Problem mit dem visuellen Effekt beim Erhalt von Belohnungen der Legendär-Klasse aus dem Wheel of Fortune behoben.",
          "Problem behoben, bei dem die Assists im Tribe Assist Ranking nicht aufgezeichnet wurden.",
          "Anzeigeproblem von Verwundete-Truppen-Daten behoben, das in \"Pillage Weston\" auftreten konnte.",
          "Problem behoben, bei dem das Senden von Emotes, während mehrere Truppen ausgewählt waren, das Schließen des Pop-up-Fensters verhinderte.",
          "Problem behoben, das verhinderte, dass die Auto-Angriffseinstellung auf \"Beast Lairs\" in \"Kingdom Mayhem\" angewendet wurde."
        ]
      }
    },
    "cn": {
      "data": {
        "major": [
          "史诗级进阶拓展！全新龙晶建筑、龙晶研究及全新兵种等级即将上线。抢先一步掌握龙晶，称霸维京时代！※ 解锁条件：王国已进入征服赛季“芬里尔的审判”，且学院等级达到25级。",
          "圣坛仪式活动即将上线。当极夜笼罩北方，古老的祭坛再次复苏。维京勇士们，奋起吧！点燃圣坛的火焰！"
        ],
        "new_features": [
          "新增“许愿之球”活动。让许愿之球照亮你的征服之路！",
          "主线任务章节拓展至35章，新增龙晶相关任务。",
          "新增“龙晶传说”活动。完成任务有机会触发“巨龙赐福”，获得巨额折扣或加倍礼包奖励。完成并领取第33章任务奖励后触发。",
          "新增“王国大乱斗”征服赛季活动“奥丁的召唤”。使用“混沌徽记”可兑换当赛季技能、英雄等多种道具，助力王国战力提升。※ 该活动在“芬里尔的审判”赛季后的无限战阶段开启。活动期间捐献道具，有机会获得[Sx战役自选宝箱]用于兑换混沌徽记。本次更新后，目前处于“王国大乱斗”无限战阶段的王国也将同步开启此活动。",
          "2025“烈焰祭祀”系列活动及皮肤返场！",
          "首次下载包体大小减少，新增资源将在进入游戏后自动下载。※ 资源仅在Wi-Fi环境下下载，移动网络下自动暂停。"
        ],
        "optimizations": [
          {
            "title": "通用",
            "items": [
              "调整了部分战力区间强国和普通王国的迁城通行证消耗。",
              "优化了城池管理体验，移除了“魔物巢穴”任务玩法，并减少了“剿灭强敌”的总关卡数。",
              "优化了“部族试炼”难度，降低了20-25级的难度，并新增了26-30级挑战。",
              "兵种创建新增筛选功能，可快速定位目标英雄。",
              "优化了进入征服赛季后“复仇之誓”和“英雄救赎”活动的难度和奖励梯度。",
              "优化了“魔物精华”、“荆棘尖刺”、“战号”、“建筑加速”和“研究加速”的回收条件。",
              "优化了坐骑淬炼和技能抽取交互，淬炼界面新增快速淬炼按钮。",
              "优化了学院、伤病营、铁匠铺和兵营的交互逻辑，建筑升级过程中也可进行研究、治疗、打造和训练。",
              "兵种预设现在可在竞技场和领主府使用。",
              "优化了皮肤商店的通知，并新增每周免费奖励。",
              "优化了排行榜选择奖励的提醒。",
              "优化了“部族日寻宝”的开奖动画和概率说明。",
              "优化了“英灵殿”的抽取体验。",
              "优化了“怒气”技能的触发条件。"
            ]
          },
          {
            "title": "王国大乱斗无限战活动",
            "items": [
              "活动期间捐献道具，现在有机会获得奖励自选宝箱。",
              "增加了征服赛季“芬里尔的审判”-“苏尔特的烈焰”期间，捐献酋长排名奖励。"
            ]
          },
          {
            "title": "部分活动和礼包内新增龙晶相关道具",
            "items": [
              "征服赛季“巴德尔的救赎”-“苏尔特的烈焰”中，兑换商店新增上一赛季英雄和技能。",
              "征服赛季“芬里尔的审判”-“苏尔特的烈焰”中，战功商店、占领成就以及酋长/团队排名奖励新增“龙晶”，并调整了“世界树之露”、“Sx英雄碎片”、“蓝色玉髓”和“淬炼果实”的数量。",
              "“永恒之轮”等主要玩法和礼包中新增“龙晶”。"
            ]
          },
          {
            "title": "Blood Oath War系列",
            "items": [
              "地图与交互：缩减地图范围，加快战斗遭遇和援军速度。",
              "权限管理：R4及以上成员进入战场后将自动获得指挥官权限，包括设置/移除书签和施放军团技能。"
            ]
          }
        ],
        "fixes": [
          "修复了部族商店“碎片市集”中部分道具无法赠送的问题。",
          "修复了“驯龙之旅”活动任务偶现刷新不及时的问题。",
          "修复了“王国大乱斗-苏尔特的烈焰”调研图标状态未能及时更新的问题。",
          "修复了迁城活动中王国战力异常波动的问题。",
          "修复了在幸运转盘中获得传说级奖励时，视觉效果异常的问题。",
          "修复了部族协助排名中未能记录协助次数的问题。",
          "修复了“劫掠威斯顿”中可能出现的伤兵数据显示异常问题。",
          "修复了选中多个部队发送表情后，弹窗无法关闭的问题。",
          "修复了“王国大乱斗”中，自动出战设置无法应用于“魔兽巢穴”的问题。"
        ]
      }
    },
    "ru": {
      "data": {
        "major": [
          "Грандиозное расширение прогресса! Скоро появятся новые здания Драконьих Кристаллов, исследования Драконьих Кристаллов и новый уровень войск. Станьте первыми, кто завладеет Драконьими Кристаллами и будет доминировать в Эпоху Викингов! ※ Для разблокировки Королевство должно вступить в Сезон Завоеваний \"Суд Фенрира\", а Академия должна быть 25-го уровня.",
          "Скоро начнется событие \"Ритуал святилища\". Когда полярная ночь окутывает Север, древние алтари снова пробуждаются. Встаньте, воины викингов! Зажгите огни святилища!"
        ],
        "new_features": [
          "Новое событие \"Сфера Желаний\". Пусть Сфера Желаний осветит ваш путь к завоеваниям!",
          "Главы основных заданий были расширены до Главы 35, с новыми заданиями, связанными с Драконьими Кристаллами.",
          "Новое событие \"Легенда о Драконьих Кристаллах\". Выполняйте задания, чтобы получить шанс активировать \"Благословение Гигантского Дракона\", предоставляющее огромные скидки или улучшенные награды за наборы. Активируется после завершения и получения наград за Главу 33.",
          "Новое событие Сезона Завоеваний \"Хаос Королевства\" - \"Призыв Одина\". Используйте \"Значки Хаоса\" для обмена на Навыки текущего сезона, Героев и другие предметы для усиления военных усилий вашего Королевства. ※ Это событие открывается во время фазы бесконечной битвы после сезона \"Суд Фенрира\". Пожертвование предметов во время события дает шанс получить [Сундуки выбора кампании Sx], которые можно обменять на Значки Хаоса. После этого обновления событие также будет синхронизировано для Королевств, находящихся в фазе бесконечной битвы \"Хаоса Королевства\".",
          "Серия событий и обликов \"Пылающая Жертва\" 2025 года возвращается!",
          "Размер первоначальной загрузки уменьшен. Дополнительные ресурсы теперь будут загружаться автоматически после входа в игру. ※ Ресурсы будут загружаться только по Wi-Fi, и загрузки будут автоматически приостанавливаться при использовании мобильных данных."
        ],
        "optimizations": [
          {
            "title": "Общие",
            "items": [
              "Уменьшено потребление Миграционных Пропусков для Сильных и Обычных Королевств в определенных диапазонах Мощи.",
              "Оптимизирован опыт управления городом путем удаления заданий и геймплея \"Пещера Монстров\" и сокращения общего количества этапов \"Уничтожение Врагов\".",
              "Оптимизирована сложность для \"Племенного Испытания\" путем снижения сложности для Уровней 20-25 и добавления испытаний для Уровней 26-30.",
              "Добавлена функция фильтрации для создания Отрядов, чтобы быстро находить нужных Героев.",
              "Оптимизировано масштабирование сложности и награды для событий \"Клятва Мести\" и \"Искупление Героя\" при входе в Сезон Завоеваний.",
              "Оптимизированы условия переработки для \"Сущности Монстра\", \"Шипастого Шипа\", \"Боевого Рога\", \"Ускорения Строительства\" и \"Ускорения Исследований\".",
              "Оптимизировано взаимодействие для Оттачивания Скакунов и Рисования Навыков. На интерфейс оттачивания добавлена кнопка \"Быстрое Оттачивание\".",
              "Оптимизирована логика взаимодействия для Академии, Лазарета, Кузницы и Казарм. Исследования, лечение, создание и обучение теперь могут проводиться во время улучшения зданий.",
              "Наборы войск теперь можно использовать на Арене и в Усадьбе.",
              "Оптимизировано уведомление для Магазина Обликов и добавлены новые еженедельные бесплатные награды.",
              "Оптимизированы напоминания о наградах за выбор Рейтинга.",
              "Оптимизирована анимация призов и описания вероятностей для \"Охоты за Сокровищами Дня Племени\".",
              "Оптимизирован процесс рисования в \"Зале Доблести\".",
              "Оптимизированы условия срабатывания Навыков \"Ярость\"."
            ]
          },
          {
            "title": "Событие \"Бесконечная Битва Хаоса Королевства\"",
            "items": [
              "Пожертвование предметов во время события теперь дает шанс получить сундуки с выбором наград.",
              "Увеличены награды Рейтинга Вождя за пожертвования во время Сезонов Завоеваний: \"Суд Фенрира\" - \"Пламя Суртра\"."
            ]
          },
          {
            "title": "Содержимое различных событий и наборов теперь включает новые материалы Драконьих Кристаллов",
            "items": [
              "Для Сезонов Завоеваний \"Искупление Бальдра\" - \"Пламя Суртра\", Герои и Навыки из предыдущего сезона были добавлены в Магазин Обмена.",
              "Для Сезонов Завоеваний \"Суд Фенрира\" - \"Пламя Суртра\", \"Драконьи Кристаллы\" были добавлены в Магазин Боевых Заслуг, Достижения Оккупации и награды Рейтинга Вождя/Команды. Количество \"Росы Иггдрасиля\", \"Осколков Героя Sx\", \"Синего Халцедона\" и \"Плода Заточки\" было скорректировано.",
              "Добавлены \"Драконьи Кристаллы\" в \"Вечное Колесо\" и другие основные функции и наборы."
            ]
          },
          {
            "title": "Серия войн Blood Oath",
            "items": [
              "Карта и Взаимодействие: Уменьшен размер карты для более быстрых боевых столкновений и подкреплений.",
              "Управление Разрешениями: Члены R4 и выше, входящие на поле боя, теперь автоматически получают права командира, включая установку/удаление Закладок и использование Навыков Легиона."
            ]
          }
        ],
        "fixes": [
          "Исправлена проблема \"Рынка Осколков\" в Магазине Племени, где некоторые предметы не могли быть подарены.",
          "Исправлена проблема \"Путешествия по Приручению Дракона\", когда квесты события иногда не обновлялись вовремя.",
          "Исправлена проблема, при которой статус иконки опроса \"Хаос Королевства - Пламя Суртра\" не обновлялся немедленно.",
          "Исправлена проблема аномального колебания Мощи Королевства в событиях миграции.",
          "Исправлена проблема визуального эффекта при получении наград Легендарного качества из Колеса Фортуны.",
          "Исправлена проблема, при которой помощь не записывалась в Рейтинге Помощи Племени.",
          "Исправлена проблема отображения данных о Раненых Войсках, которая могла возникать в \"Разорении Вестона\".",
          "Исправлена проблема, при которой отправка Эмоций при выбранных нескольких Отрядах препятствовала закрытию всплывающего окна.",
          "Исправлена проблема, которая препятствовала применению настройки автоатаки к \"Логовам Зверей\" в \"Хаосе Королевства\"."
        ]
      }
    }
  },
  {
    "id": "update_17_12_2025",
    "meta": {
      "created_at": "2025-12-15T04:08:00Z",
      "start_timestamp": "2025-12-17T06:00:00+00:00",
      "display_time": "17. Dez 2025, 06:00 - 06:30 (UTC)",
      "title_en": "Update Dec 17",
      "title_de": "Update vom 17.12.",
      "title_cn": "12月17日更新",
      "title_ru": "Обновление 17 декабря"
    },
    "en": {
      "major": [
        "The Kingdom Mayhem Conquest Season [Surtr's Flames] is about to begin. Flames roar in Muspelheim!",
        "New Collaboration: Partnering with <How to Train Your Dragon>, let us embark on a Dragon Taming Journey!",
        "Christmas Event: Carriage racing event and newly designed Christmas Skins."
      ],
      "new_features": [
        "Added monthly card [Lightshade Journey] (activates Tribe Auto-Assist).",
        "Added a second Research queue (via Research Order Pack).",
        "Optimized [Quick Upgrade] for Hero Talents and added [Quick Upgrade] for skills.",
        "Added [Tribe Shop] - [Shard Market] to exchange Hero/Skill Shards.",
        "Added [2025 Hero Skin Choice Chest I] to Tribe Day Treasure Hunt.",
        "Added bulk donate function to Tribe Tech.",
        "Added [Add Friend] feature when viewing other players' Chief Profile.",
        "Added item quantity display bubbles in Inventory.",
        "Added a save draft function for Chat (stored locally).",
        "Added [Combat Settings] on mobile (Option to garrison after attacking)."
      ],
      "optimizations": [
        {
          "title": "Events & Returning",
          "items": [
            "Returning: 2024 Christmas series [Sparkling Holiday Night] set & [Snowy Deer's Shadow] flag."
          ]
        },
        {
          "title": "Blood Oath War",
          "items": [
            "Legions reduced from 3 to 1 in Midgard Championship.",
            "Garrisoned troops accumulate the same debuff as central buildings.",
            "Ranking rules optimized: Ties are decided by higher total kill points.",
            "Registration menu now clearly displays Legion member rules."
          ]
        },
        {
          "title": "UI & System",
          "items": [
            "Added coordinate sharing function (share spaces, buildings, cities, troops, monsters).",
            "Optimized display and performance of some pages.",
            "Optimized [Speedup Queue] menu organization (Training, Research, Healing, Forge).",
            "Optimized multi-troop selection logic for Marching.",
            "Optimized display for [Wheel of Fortune] & [Skill Wheel] + added notification text.",
            "Optimized interface for preset King's Decrees.",
            "Optimized [Mail] sorting/cleanup and extended expiration times.",
            "Optimized [Hall of Valor] interactions and performance.",
            "Optimized [Language Settings]: Split into System Language and Chat Translation Language.",
            "Optimized [Campaign] menu: Inactive events are hidden.",
            "Collector overview: Now displays bonuses from skins with unlock attributes.",
            "Optimized notification text after translating chat.",
            "Hero Skin unlocking: No longer gifts 10 corresponding shards."
          ]
        },
        {
          "title": "Rewards",
          "items": [
            "Conquest Season: Increased Recast Blades & adjusted Yggdrasil Dew distribution (Fenrir's Judgment, Hela's Curse, Baldr's Redemption, Alfheim's Defense)."
          ]
        }
      ],
      "fixes": [
        "Fixed an abnormal refresh issue in [Mail].",
        "Fixed display issue with [Campaign - Drill Ground] on PC.",
        "Fixed Hero Talents not taking effect in [Drill Ground].",
        "Fixed forge progress display issue in [Equipment Forge].",
        "Fixed avatar display issue when rallying neutral troops.",
        "Fixed medium checkpoints display in [Hela's Curse].",
        "Fixed text display issue in [Magic Card Blessing].",
        "Fixed damage progress display in [Sworn Vengeance] ranking.",
        "Fixed lag issue in [Magic Card Adventure].",
        "Fixed display issue in [Time-Limited Migration] searches."
      ]
    },
    "de": {
      "major": [
        "Die Königreich-Chaos Eroberungssaison [Surtrs Flammen] beginnt. Muspelheim brennt!",
        "Neue Kollaboration: Gemeinsam mit <Drachenzähmen leicht gemacht> auf Drachenjagd gehen!",
        "Weihnachts-Event: Kutschenrennen und neue Weihnachts-Skins."
      ],
      "new_features": [
        "Monatskarte [Lichtschatten-Reise] hinzugefügt (Aktiviert Stamm Auto-Assistenz).",
        "Zweite Forschungswarteschlange hinzugefügt (via Forschungsauftrag-Paket).",
        "Optimiertes [Schnell-Upgrade] für Talente und neu für Skills hinzugefügt.",
        "[Stamm-Shop] - [Splittermarkt] hinzugefügt (Tausch von Helden/Skill-Splittern).",
        "[2025 Helden-Skin-Auswahltruhe I] zur Stammestag-Schatzsuche hinzugefügt.",
        "Massenspende-Funktion für Stammestechnik hinzugefügt.",
        "[Freund hinzufügen] Funktion im Häuptlingsprofil ergänzt.",
        "Mengenanzeige-Bubbles im Inventar hinzugefügt.",
        "Entwurf-Speicherfunktion für den Chat hinzugefügt (lokal gespeichert).",
        "[Kampfeinstellungen] auf Mobile: Option zum Garnisonieren nach Angriff hinzugefügt."
      ],
      "optimizations": [
        {
          "title": "Events & Rückkehr",
          "items": [
            "Rückkehr: Weihnachts-Serie 2024 [Funkelnde Weihnachtsnacht] Set & [Schneehirsches Schatten] Flagge."
          ]
        },
        {
          "title": "Bluteid-Krieg (Optimiert)",
          "items": [
            "Legionen in der Midgard-Meisterschaft von 3 auf 1 reduziert.",
            "Garnisonstruppen sammeln nun denselben Debuff wie zentrale Gebäude.",
            "Ranglistenregeln optimiert: Bei Gleichstand entscheiden höhere Kill-Punkte.",
            "Anmeldemenü zeigt nun klar die Regeln für Legionsmitglieder."
          ]
        },
        {
          "title": "UI & System",
          "items": [
            "Koordinaten-Teilen Funktion hinzugefügt (für leere Flächen, Gebäude, Städte, Truppen, Monster).",
            "Anzeige und Performance einiger Seiten optimiert.",
            "[Beschleunigungs-Warteschlange] neu organisiert (Training, Forschung, Heilung, Schmiede).",
            "Multi-Truppen-Auswahl beim Marschieren optimiert.",
            "Anzeige für [Glücksrad] und [Skill-Rad] optimiert + Hinweistext.",
            "Interface für Königserlasse-Voreinstellungen optimiert.",
            "[Post]: Sortierung/Bereinigung optimiert, Ablaufzeit verlängert.",
            "[Halle der Tapferkeit]: Interaktionen und Performance verbessert.",
            "[Spracheinstellungen]: Unterteilt in System- und Chat-Übersetzungssprache.",
            "[Kampagne]: Inaktive Events werden im Menü ausgeblendet.",
            "Sammler-Übersicht: Zeigt nun Boni von Skins mit Freischalt-Attributen korrekt an.",
            "Hinweistext nach Chat-Übersetzung optimiert.",
            "Helden-Skin Freischaltung: Es werden keine 10 Splitter mehr geschenkt."
          ]
        },
        {
          "title": "Belohnungen",
          "items": [
            "Eroberungssaison: Mehr Umschmiede-Klingen & angepasste Menge an Yggdrasil-Tau (Fenrir, Hela, Baldr, Alfheim)."
          ]
        }
      ],
      "fixes": [
        "Refresh-Problem in der [Post] behoben.",
        "Anzeigefehler beim [Drill Ground] Eingang (PC Version) behoben.",
        "Fehler behoben, dass Heldentalente im [Drill Ground] nicht wirksam waren.",
        "Anzeigefehler beim Schmiedefortschritt in der [Ausrüstungsschmiede] behoben.",
        "Avatar-Anzeigefehler beim Sammeln neutraler Truppen behoben.",
        "Anzeigefehler bei mittleren Checkpoints in [Hela's Curse] behoben.",
        "Textanzeigefehler in [Magic Card Blessing] behoben.",
        "Schadensfortschritts-Anzeige im [Sworn Vengeance] Ranking behoben.",
        "Lag-Probleme im [Magic Card Adventure] behoben.",
        "Anzeigefehler bei der Suche nach Königreichen in [Zeitlich begrenzter Migration] behoben."
      ]
    },
    "cn": {
      "major": [
        "王国纷争征服赛季 [苏尔特尔的火焰] 即将开始。火焰在穆斯贝尔海姆咆哮！",
        "新联动：与《驯龙高手》合作，让我们踏上驯龙之旅！",
        "圣诞活动：马车竞速活动和全新设计的圣诞皮肤。"
      ],
      "new_features": [
        "新增月卡 [光影之旅]（激活部落自动协助）。",
        "新增第二条研究队列（通过研究令礼包）。",
        "优化英雄天赋的 [快速升级] 并新增技能的 [快速升级]。",
        "新增 [部落商店] - [碎片市场]，用于交换英雄/技能碎片。",
        "部落日寻宝新增 [2025英雄皮肤自选箱I]。",
        "部落科技新增批量捐赠功能。",
        "查看其他玩家首领资料时新增 [添加好友] 功能。",
        "背包中新增物品数量显示气泡。",
        "聊天新增草稿保存功能（本地存储）。",
        "移动端新增 [战斗设置]（攻击后驻防选项）。"
      ],
      "optimizations": [
        {
          "title": "活动与回归",
          "items": [
            "回归：2024圣诞系列 [璀璨假日之夜] 套装 & [雪鹿之影] 旗帜。"
          ]
        },
        {
          "title": "血誓之战",
          "items": [
            "米德加尔特锦标赛军团数量从3个减少到1个。",
            "驻防部队现在会累积与中心建筑相同的减益效果。",
            "排名规则优化：平局时由总击杀分较高者胜出。",
            "报名界面现在清晰显示军团成员规则。"
          ]
        },
        {
          "title": "界面与系统",
          "items": [
            "新增坐标分享功能（分享空地、建筑、城市、部队、怪物）。",
            "优化部分页面的显示和性能。",
            "优化 [加速队列] 菜单组织（训练、研究、治疗、锻造）。",
            "优化行军时的多部队选择逻辑。",
            "优化 [幸运转盘] & [技能转盘] 显示 + 新增提示文本。",
            "优化预设王令的界面。",
            "优化 [邮件] 排序/清理并延长过期时间。",
            "优化 [英灵殿] 交互和性能。",
            "优化 [语言设置]：拆分为系统语言和聊天翻译语言。",
            "优化 [战役] 菜单：非活动事件现在隐藏。",
            "收藏家概览：现在正确显示带有解锁属性的皮肤加成。",
            "优化聊天翻译后的提示文本。",
            "英雄皮肤解锁：不再赠送10个对应碎片。"
          ]
        },
        {
          "title": "奖励",
          "items": [
            "征服赛季：增加重铸之刃数量 & 调整尤克特拉希尔之露分布（芬里尔的审判、海拉的诅咒、巴德尔的救赎、亚尔夫海姆的防御）。"
          ]
        }
      ],
      "fixes": [
        "修复了 [邮件] 中的异常刷新问题。",
        "修复了PC端 [演武场] 的显示问题。",
        "修复了英雄天赋在 [演武场] 中不生效的问题。",
        "修复了 [装备锻造] 中的锻造进度显示问题。",
        "修复了集结中立部队时的头像显示问题。",
        "修复了 [海拉的诅咒] 中中级检查点的显示问题。",
        "修复了 [魔卡祝福] 中的文本显示问题。",
        "修复了 [血仇] 排名中的伤害进度显示问题。",
        "修复了 [魔卡冒险] 中的延迟问题。",
        "修复了 [限时迁城] 搜索中的显示问题。"
      ]
    },
    "ru": {
      "major": [
        "Сезон завоевания «Хаос Королевства» [Пламя Сурта] вот-вот начнется. Пламя ревет в Муспельхейме!",
        "Новая коллаборация: Партнерство с «Как приручить дракона», отправляемся в путешествие по приручению драконов!",
        "Рождественское событие: Гонки на повозках и новые рождественские скины."
      ],
      "new_features": [
        "Добавлена месячная карта [Путешествие света и тени] (активирует авто-помощь племени).",
        "Добавлена вторая очередь исследований (через пакет «Приказ об исследовании»).",
        "Оптимизировано [Быстрое улучшение] для талантов героев и добавлено для навыков.",
        "Добавлен [Магазин племени] - [Рынок осколков] для обмена осколков героев/навыков.",
        "В Охоту за сокровищами Дня племени добавлен [Сундук выбора скина героя 2025 I].",
        "Добавлена функция массового пожертвования в технологии племени.",
        "Добавлена функция [Добавить в друзья] при просмотре профиля вождя других игроков.",
        "Добавлены пузырьки с отображением количества предметов в инвентаре.",
        "Добавлена функция сохранения черновика для чата (хранится локально).",
        "Добавлены [Настройки боя] на мобильных (Опция гарнизона после атаки)."
      ],
      "optimizations": [
        {
          "title": "События и возвращение",
          "items": [
            "Возвращение: Рождественская серия 2024 набор [Сверкающая праздничная ночь] и флаг [Тень снежного оленя]."
          ]
        },
        {
          "title": "Война Клятвы Крови",
          "items": [
            "Количество легионов в Чемпионате Мидгарда сокращено с 3 до 1.",
            "Войска в гарнизоне теперь накапливают тот же дебафф, что и центральные здания.",
            "Оптимизированы правила рейтинга: при ничьей побеждает тот, у кого больше очков убийств.",
            "Меню регистрации теперь четко отображает правила для членов легиона."
          ]
        },
        {
          "title": "Интерфейс и система",
          "items": [
            "Добавлена функция обмена координатами (поделиться пустыми местами, зданиями, городами, войсками, монстрами).",
            "Оптимизировано отображение и производительность некоторых страниц.",
            "Оптимизирована организация меню [Очередь ускорений] (Тренировка, Исследование, Лечение, Ковка).",
            "Оптимизирована логика выбора нескольких отрядов при марше.",
            "Оптимизировано отображение для [Колеса Фортуны] и [Колеса Навыков] + добавлен текст уведомления.",
            "Оптимизирован интерфейс для предустановок Королевских указов.",
            "Оптимизирована сортировка/очистка [Почты] и продлено время истечения срока действия.",
            "Оптимизировано взаимодействие и производительность [Зала Доблести].",
            "Оптимизированы [Настройки языка]: Разделены на язык системы и язык перевода чата.",
            "Оптимизировано меню [Кампания]: неактивные события скрыты.",
            "Обзор коллекционера: Теперь корректно отображает бонусы от скинов с атрибутами разблокировки.",
            "Оптимизирован текст уведомления после перевода чата.",
            "Разблокировка скинов героев: Больше не дарится 10 соответствующих осколков."
          ]
        },
        {
          "title": "Награды",
          "items": [
            "Сезон завоевания: Увеличено количество Клинков перековки и скорректировано распределение Росы Иггдрасиля (Суд Фенрира, Проклятие Хелы, Искупление Бальдра, Оборона Альфхейма)."
          ]
        }
      ],
      "fixes": [
        "Исправлена проблема с аномальным обновлением в [Почте].",
        "Исправлена проблема отображения [Плаца] в Кампании на ПК.",
        "Исправлена ошибка, из-за которой таланты героя не действовали на [Плацу].",
        "Исправлена проблема отображения прогресса ковки в [Кузнице снаряжения].",
        "Исправлена проблема отображения аватара при сборе нейтральных войск.",
        "Исправлена проблема отображения средних контрольных точек в [Проклятии Хелы].",
        "Исправлена проблема отображения текста в [Благословении магических карт].",
        "Исправлена проблема отображения прогресса урона в рейтинге [Клятва мести].",
        "Исправлена проблема с лагами в [Приключении магических карт].",
        "Исправлена проблема отображения при поиске в [Миграции ограниченного времени]."
      ]
    }
  }
]