[
  {
    "id": "1459498212108013632",
    "meta": {
      "created_at": "2026-01-10T10:44:49.932000+00:00",
      "start_timestamp": "2025-11-17T03:00:00+00:00",
      "display_time": "17. Nov 2025",
      "title_en": "Update 17. Nov 2025",
      "title_de": "Update vom 17. Nov 2025",
      "title_cn": "更新 17. Nov 2025",
      "title_ru": "Обновление 17. Nov 2025",
      "image_url": ""
    },
    "en": {
      "data": {
        "major": [
          "The Thanksgiving Event is coming soon, let's celebrate together!",
          "Added SX heroes Sea's Embrace · Gloa and Crimson Arrow · Dalen. They will be available when the Kingdom reaches 813 days (Dalen) and 809 days (Gloa) respectively.",
          "Added SX skills \"Raven of Death\", \"Rainbow Bridge Miracle\", and \"Fafnir's Riddle\", which will be available when the Kingdom reaches 803 days."
        ],
        "new_features": [
          "Added the \"Drill Ground\" feature. You can now customize hero combinations for duels and test your optimal hero lineup.",
          "The Event Hub now has a \"Completed Events\" tab, automatically including events with all rewards claimed.",
          "Added \"Hero promotion\" feature, Hero Ivor can now be promoted to Legendary Hero",
          "Optimized \"Daily Quest\" content. Added a new daily quest type: simply purchase a pack to earn 100 Activity Points and claim all daily rewards",
          "Optimized \"City management\" interaction, interface now includes a 4-hour Shield item"
        ],
        "optimizations": [
          {
            "title": "System & UI",
            "items": [
              "\"Kingdom Might\" now calculates in real-time.",
              "The \"2024 Thanksgiving\" event limited-time skin series returns.",
              "The \"Tribe Day Treasure Hunt\" choice chest has been replaced with the 2025 January~June skin choice chest.",
              "Optimized the \"Trial of Courage\" Personal Conquest interface, adding tier and quantity recommendations",
              "Optimized the \"Sworn Vengeance\" interaction. When Tribe progress reaches the maximum, a secondary confirmation pop-up appears for repeated submissions",
              "Optimized the display when \"Enemy Extermination\" Stage goals are achieved.",
              "Optimized \"mail\" function",
              "Optimized \"forge materials\" interface, the list of equipment available for forging can now be viewed",
              "Optimized \"Personal Might Ranking\" display, Tribe full name display removed",
              "Optimized \"King's Decree\" tips, now triggers only the first time you become King"
            ]
          },
          {
            "title": "Gameplay & Economy",
            "items": [
              "Lowered the Battalion occupy achievement requirements for \"Alfheim's Defense\", reducing the number of Lv5 and Lv6 Lairs to be occupied simultaneously.",
              "Increased the weekly purchase limit for Blue Chalcedony and Recast Blade in the Prosperity Shop.",
              "Increased the weekly purchase limit for the Honing Fruit, Yggdrasil Dew, and Blue Chalcedony in the Prestige Shop. (valid during Conquest Season)",
              "Increased the weekly purchase limit for Blue Chalcedony, Yggdrasil Dew, and Honing Fruit in the clan shop (effective next refresh).",
              "Optimized the \"Hero Reclamation\" gameplay, supporting quick summon and claiming of current map rewards",
              "Optimized the \"Blood Oath War\" & \"Battle of the Ruins\" gameplay",
              "Optimized \"Battle\" related functions",
              "Optimized \"Tribe\" feature",
              "Optimized player inner city operations",
              "Optimized \"Side Quest\" interaction, supporting quick reward claiming",
              "Optimized Arena matching rules, dispatched Troop max quantity now matches defender's league"
            ]
          },
          {
            "title": "Heroes",
            "items": [
              "Optimized \"Hero\" core ability display",
              "Optimized \"Hero Talent\" interface",
              "Optimized \"Brutal Fighter · Cecia\" voice lines"
            ]
          }
        ],
        "fixes": [
          "Fixed an error in the march status on the Air Dock minimap",
          "Fixed abnormal animation in the item acquisition interface",
          "Fixed abnormal pop-up data when viewing Rainbow Bridge in other season maps",
          "Fixed incorrect description for occupying Lv 6 buildings during the \"Alfheim's Defense\" Chronicles - Invincible stage",
          "Fixed abnormal text layout in pop-ups when viewing gathering points in other season maps",
          "Fixed abnormal display in some season status bars",
          "Fixed abnormal display of Tribe building construction in some season maps",
          "Fixed abnormal display of Beast Lair quantity in \"Tribe Territory\"",
          "Fixed abnormal display in the \"Escort Caravan\" interface",
          "Fixed an issue where vacant Tribe positions in other Kingdoms showed local Tribe players",
          "Fixed some display issues in \"Blood Oath War\"",
          "Fixed abnormal red dot display when switching stages in \"Blood Oath War\" under certain circumstances",
          "Fixed abnormal display of scout queue in \"Troop Overview\"",
          "Fixed abnormal display of the locate button when player ranking is not within the ranking quota",
          "Fixed abnormal display when purchasing items in the Divine Jewel Shop",
          "Fixed abnormal Might sorting after Tribe member resigns as Jarl",
          "Fixed abnormal bookmark placement in \"Battle of the Ruins\"",
          "Fixed abnormal display in the \"Scout Report\"",
          "Fixed abnormal display when quickly exchanging items in \"Serpent Spirit Potion\"",
          "Fixed abnormal prompt when converting materials in \"Dragon's Lair\" with insufficient materials",
          "Fixed abnormal display of local terrain in the Expedition to England map",
          "Fixed abnormal chat channel issue after switching system language",
          "Fixed abnormal display of Tribe Leader names in the Tribe Might Ranking"
        ]
      }
    },
    "de": {
      "data": {
        "major": [
          "Das Thanksgiving Event steht vor der Tür, lasst uns gemeinsam feiern!",
          "SX-Helden Meeresumarmung · Gloa und Karmesinroter Pfeil · Dalen wurden hinzugefügt. Sie werden verfügbar sein, wenn das Königreich 813 Tage (Dalen) bzw. 809 Tage (Gloa) erreicht.",
          "SX-Fähigkeiten „Rabe des Todes“, „Wunder der Regenbogenbrücke“ und „Fafnirs Rätsel“ wurden hinzugefügt, die verfügbar sein werden, wenn das Königreich 803 Tage erreicht."
        ],
        "new_features": [
          "Das Feature „Übungsplatz“ wurde hinzugefügt. Du kannst nun Heldenkombinationen für Duelle anpassen und deine optimale Heldenaufstellung testen.",
          "Der Event-Hub verfügt nun über einen Tab „Abgeschlossene Events“, der automatisch Events mit allen beanspruchten Belohnungen enthält.",
          "Das Feature „Heldenbeförderung“ wurde hinzugefügt, Held Ivor kann nun zum Legendären Helden befördert werden.",
          "Inhalt der „Täglichen Quests“ optimiert. Ein neuer täglicher Quest-Typ wurde hinzugefügt: Kaufe einfach ein Paket, um 100 Aktivitätspunkte zu verdienen und alle täglichen Belohnungen zu beanspruchen.",
          "Interaktion der „Stadtverwaltung“ optimiert, die Benutzeroberfläche enthält nun einen 4-Stunden-Schild-Gegenstand."
        ],
        "optimizations": [
          {
            "title": "System & Benutzeroberfläche",
            "items": [
              "Die „Königreichsmacht“ wird nun in Echtzeit berechnet.",
              "Die Skin-Serie zum „2024 Thanksgiving“-Event kehrt zurück.",
              "Die Auswahlkiste der „Stammes-Tag Schatzsuche“ wurde durch die Skin-Auswahlkiste Januar~Juni 2025 ersetzt.",
              "Die Benutzeroberfläche der persönlichen Eroberung im „Mutprobe“ wurde optimiert und enthält nun Stufen- und Mengenempfehlungen.",
              "Die Interaktion der „Geschworene Rache“ wurde optimiert. Wenn der Stammesfortschritt das Maximum erreicht, erscheint ein sekundäres Bestätigungs-Pop-up für wiederholte Einreichungen.",
              "Die Anzeige bei Erreichen der Etappenziele von „Feindausrottung“ wurde optimiert.",
              "Die „Mail“-Funktion wurde optimiert.",
              "Die Benutzeroberfläche der „Schmiedematerialien“ wurde optimiert, die Liste der zum Schmieden verfügbaren Ausrüstung kann nun eingesehen werden.",
              "Die Anzeige der „Persönlichen Macht-Rangliste“ wurde optimiert, die vollständige Stammesnamenanzeige wurde entfernt.",
              "Die Tipps zum „Königlichen Erlass“ wurden optimiert, werden nun nur beim ersten Mal ausgelöst, wenn man König wird."
            ]
          },
          {
            "title": "Gameplay & Wirtschaft",
            "items": [
              "Die Anforderungen für das Erreichen der Bataillonsbesetzung in „Alfheims Verteidigung“ wurden gesenkt, wodurch die Anzahl der gleichzeitig zu besetzenden Lv5- und Lv6-Lager reduziert wird.",
              "Das wöchentliche Kauflimit für Blauen Chalzedon und Umschmiedeklinge im Wohlstandsladen wurde erhöht.",
              "Das wöchentliche Kauflimit für die Schärffrucht, Yggdrasil-Tau und Blauen Chalzedon im Prestige-Shop wurde erhöht. (gültig während der Eroberungssaison)",
              "Das wöchentliche Kauflimit für Blauen Chalzedon, Yggdrasil-Tau und Schärffrucht im Clan-Shop wurde erhöht (wirksam nach der nächsten Aktualisierung).",
              "Das „Heldenrückgewinnung“-Gameplay wurde optimiert, unterstützt schnelles Beschwören und Beanspruchen aktueller Kartenbelohnungen.",
              "Das Gameplay von „Blood Oath War“ & „Schlacht der Ruinen“ wurde optimiert.",
              "„Kampf“-bezogene Funktionen wurden optimiert.",
              "Das „Stamm“-Feature wurde optimiert.",
              "Die Operationen in der inneren Stadt des Spielers wurden optimiert.",
              "Die „Nebenquest“-Interaktion wurde optimiert, unterstützt schnelles Beanspruchen von Belohnungen.",
              "Die Arena-Matching-Regeln wurden optimiert, die maximale Anzahl der entsandten Truppen entspricht nun der Liga des Verteidigers."
            ]
          },
          {
            "title": "Helden",
            "items": [
              "Die Anzeige der „Helden“-Kernfähigkeit wurde optimiert.",
              "Die Benutzeroberfläche der „Helden-Talente“ wurde optimiert.",
              "Die Sprachausgabe von „Brutale Kämpferin · Cecia“ wurde optimiert."
            ]
          }
        ],
        "fixes": [
          "Ein Fehler im Marschstatus auf der Minimap des Luftdocks wurde behoben.",
          "Abnormale Animationen in der Gegenstandserfassungs-Benutzeroberfläche wurden behoben.",
          "Abnormale Pop-up-Daten beim Betrachten der Regenbogenbrücke auf anderen Saisonkarten wurden behoben.",
          "Eine inkorrekte Beschreibung für die Besetzung von Lv 6 Gebäuden während der „Alfheims Verteidigung“ Chroniken – Unbesiegbar-Phase wurde behoben.",
          "Abnormale Textanordnung in Pop-ups beim Betrachten von Sammelpunkten auf anderen Saisonkarten wurde behoben.",
          "Abnormale Anzeige in einigen Saison-Statusleisten wurde behoben.",
          "Abnormale Anzeige des Stammesgebäude-Baus auf einigen Saisonkarten wurde behoben.",
          "Abnormale Anzeige der Anzahl der Bestienlager im „Stammesgebiet“ wurde behoben.",
          "Abnormale Anzeige in der Benutzeroberfläche „Karawane eskortieren“ wurde behoben.",
          "Ein Problem wurde behoben, bei dem freie Stammespositionen in anderen Königreichen lokale Stammes-Spieler anzeigten.",
          "Einige Anzeigeprobleme im „Blood Oath War“ wurden behoben.",
          "Abnormale Anzeige des roten Punktes beim Wechseln der Phasen im „Blood Oath War“ unter bestimmten Umständen wurde behoben.",
          "Abnormale Anzeige der Späher-Warteschlange in der „Truppenübersicht“ wurde behoben.",
          "Abnormale Anzeige der Schaltfläche „Ortung“ wurde behoben, wenn die Spielerplatzierung nicht innerhalb des Ranglistenkontingents liegt.",
          "Abnormale Anzeige beim Kauf von Gegenständen im Göttlichen Juwelenladen wurde behoben.",
          "Abnormale Macht-Sortierung nach dem Rücktritt eines Stammesmitglieds als Jarl wurde behoben.",
          "Abnormale Platzierung von Lesezeichen in der „Schlacht der Ruinen“ wurde behoben.",
          "Abnormale Anzeige im „Späherbericht“ wurde behoben.",
          "Abnormale Anzeige beim schnellen Tauschen von Gegenständen in „Schlangengeist-Trank“ wurde behoben.",
          "Abnormale Aufforderung beim Umwandeln von Materialien in „Drachenhort“ mit unzureichenden Materialien wurde behoben.",
          "Abnormale Anzeige des lokalen Geländes auf der Karte „Expedition nach England“ wurde behoben.",
          "Abnormales Chat-Kanal-Problem nach dem Wechsel der Systemsprache wurde behoben.",
          "Abnormale Anzeige der Stammesführer-Namen in der Stammesmacht-Rangliste wurde behoben."
        ]
      }
    },
    "cn": {
      "data": {
        "major": [
          "感恩节活动即将到来，让我们一起庆祝吧！",
          "新增SX英雄海之拥抱·格罗娅和绯红之箭·达伦。他们将分别在王国达到813天（达伦）和809天（格罗娅）时解锁。",
          "新增SX技能“死亡渡鸦”、“彩虹桥奇迹”和“法夫纳之谜”，它们将在王国达到803天时解锁。"
        ],
        "new_features": [
          "新增“演武场”功能。现在你可以自定义英雄组合进行对决，并测试你的最佳英雄阵容。",
          "活动中心现在新增“已完成活动”页签，自动收录已领取所有奖励的活动。",
          "新增“英雄晋升”功能，英雄伊沃尔现在可以晋升为传奇英雄。",
          "优化“日常任务”内容。新增一种日常任务类型：只需购买一个礼包即可获得100活跃点并领取所有日常奖励。",
          "优化“城建”交互，界面现在包含4小时护盾道具。"
        ],
        "optimizations": [
          {
            "title": "系统与界面",
            "items": [
              "“王国战力”现在实时计算。",
              "“2024感恩节”活动限时皮肤系列返场。",
              "“部落日寻宝”自选宝箱已替换为2025年1月~6月皮肤自选宝箱。",
              "优化“勇者试炼”个人征程界面，新增阶层和数量推荐。",
              "优化“复仇血誓”交互。当部落进度达到最大时，重复提交会出现二次确认弹窗。",
              "优化“歼灭敌军”阶段目标达成时的显示。",
              "优化“邮件”功能。",
              "优化“锻造材料”界面，现在可以查看可锻造装备列表。",
              "优化“个人战力排行”显示，移除部落全名显示。",
              "优化“国王谕令”提示，现在仅在首次成为国王时触发。"
            ]
          },
          {
            "title": "玩法与经济",
            "items": [
              "降低“亚尔夫海姆防线”的军团占领成就要求，减少同时占领5级和6级巢穴的数量。",
              "繁荣商店中蓝玉髓和重铸之刃的每周购买限次增加。",
              "威望商店中磨砺之果、世界树露水和蓝玉髓的每周购买限次增加。（征服赛季期间有效）",
              "部落商店中蓝玉髓、世界树露水和磨砺之果的每周购买限次增加（下次刷新生效）。",
              "优化“英雄召回”玩法，支持快速召唤和领取当前地图奖励。",
              "优化 \"Blood Oath War\" 和“遗迹之战”玩法。",
              "优化“战斗”相关功能。",
              "优化“部落”功能。",
              "优化玩家内城操作。",
              "优化“支线任务”交互，支持快速领取奖励。",
              "优化竞技场匹配规则，派遣部队最大数量现在与防守方联盟等级匹配。"
            ]
          },
          {
            "title": "英雄",
            "items": [
              "优化“英雄”核心能力显示。",
              "优化“英雄天赋”界面。",
              "优化“残暴斗士·塞西娅”语音。"
            ]
          }
        ],
        "fixes": [
          "修复空军码头小地图行军状态显示异常的问题。",
          "修复道具获取界面动画异常的问题。",
          "修复在其他赛季地图查看彩虹桥时弹窗数据异常的问题。",
          "修复“亚尔夫海姆防线”编年史-无敌阶段中占领6级建筑的描述错误。",
          "修复在其他赛季地图查看采集点时弹窗文本布局异常的问题。",
          "修复部分赛季状态栏显示异常的问题。",
          "修复部分赛季地图中部落建筑建造显示异常的问题。",
          "修复“部落领地”中兽穴数量显示异常的问题。",
          "修复“护送商队”界面显示异常的问题。",
          "修复其他王国空缺部落职位显示为本地部落玩家的问题。",
          "修复 \"Blood Oath War\" 中的一些显示问题。",
          "修复在某些情况下 \"Blood Oath War\" 切换阶段时红点显示异常的问题。",
          "修复“部队总览”中侦察队列显示异常的问题。",
          "修复玩家排名不在排行榜配额内时定位按钮显示异常的问题。",
          "修复神圣宝石商店购买道具时显示异常的问题。",
          "修复部落成员辞去酋长后战力排序异常的问题。",
          "修复“遗迹之战”中书签位置异常的问题。",
          "修复“侦察报告”显示异常的问题。",
          "修复“蛇灵药剂”中快速兑换道具时显示异常的问题。",
          "修复“巨龙巢穴”中材料不足时转换材料提示异常的问题。",
          "修复远征英格兰地图中本地地形显示异常的问题。",
          "修复切换系统语言后聊天频道异常的问题。",
          "修复部落战力排名中部落首领名称显示异常的问题。"
        ]
      }
    },
    "ru": {
      "data": {
        "major": [
          "Скоро начнется событие «День Благодарения», давайте праздновать вместе!",
          "Добавлены SX-герои Объятия Моря · Глоа и Багровая Стрела · Дален. Они будут доступны, когда Королевство достигнет 813 дней (Дален) и 809 дней (Глоа) соответственно.",
          "Добавлены SX-навыки «Ворон Смерти», «Чудо Радужного Моста» и «Загадка Фафнира», которые будут доступны, когда Королевство достигнет 803 дней."
        ],
        "new_features": [
          "Добавлена функция «Тренировочная Площадка». Теперь вы можете настраивать комбинации героев для дуэлей и тестировать свой оптимальный состав героев.",
          "В Центре Событий теперь есть вкладка «Завершенные События», автоматически включающая события со всеми полученными наградами.",
          "Добавлена функция «Повышение героя», Героя Айвора теперь можно повысить до Легендарного Героя",
          "Оптимизировано содержание «Ежедневных Заданий». Добавлен новый тип ежедневных заданий: просто приобретите набор, чтобы получить 100 Очков Активности и забрать все ежедневные награды.",
          "Оптимизировано взаимодействие с «Управлением Городом», интерфейс теперь включает предмет Щит на 4 часа"
        ],
        "optimizations": [
          {
            "title": "Система и Интерфейс",
            "items": [
              "«Мощь Королевства» теперь рассчитывается в реальном времени.",
              "Ограниченная серия обликов «День Благодарения 2024» возвращается.",
              "Сундук выбора «Охота за Сокровищами Дня Племени» заменен сундуком выбора обликов на январь-июнь 2025 года.",
              "Оптимизирован интерфейс личного завоевания «Испытание Отваги», добавлены рекомендации по уровню и количеству.",
              "Оптимизировано взаимодействие «Клятвенная Месть». Когда прогресс Племени достигает максимума, появляется всплывающее окно вторичного подтверждения для повторных отправлений.",
              "Оптимизировано отображение при достижении целей этапа «Истребление Врагов».",
              "Оптимизирована функция «Почта».",
              "Оптимизирован интерфейс «Материалы Кузни», теперь можно просмотреть список доступного для ковки снаряжения.",
              "Оптимизировано отображение «Рейтинга Личной Мощи», полное название Племени удалено.",
              "Оптимизированы подсказки «Указа Короля», теперь срабатывают только при первом становлении Королем."
            ]
          },
          {
            "title": "Геймплей и Экономика",
            "items": [
              "Снижены требования к достижению оккупации батальоном для «Защиты Альвхейма», уменьшено количество одновременно оккупируемых логовищ 5-го и 6-го уровней.",
              "Увеличен еженедельный лимит покупки Синего Халцедона и Переплавленного Клинка в Лавке Процветания.",
              "Увеличен еженедельный лимит покупки Затачивающего Плода, Росы Иггдрасиля и Синего Халцедона в Лавке Престижа. (Действительно во время Сезона Завоеваний).",
              "Увеличен еженедельный лимит покупки Синего Халцедона, Росы Иггдрасиля и Затачивающего Плода в клановом магазине (вступает в силу со следующего обновления).",
              "Оптимизирован геймплей «Возвращение Героев», поддерживающий быстрый призыв и получение наград текущей карты.",
              "Оптимизирован геймплей «Blood Oath War» и «Битва Руин».",
              "Оптимизированы функции, связанные с «Битвой».",
              "Оптимизирована функция «Племя».",
              "Оптимизированы операции игрока во внутреннем городе.",
              "Оптимизировано взаимодействие «Побочных Заданий», поддерживающее быстрое получение наград.",
              "Оптимизированы правила подбора на Арене, максимальное количество отправленных Отрядов теперь соответствует лиге защитника."
            ]
          },
          {
            "title": "Герои",
            "items": [
              "Оптимизировано отображение основных способностей «Героев».",
              "Оптимизирован интерфейс «Талантов Героев».",
              "Оптимизированы голосовые реплики «Жестокого Бойца · Сесилии»."
            ]
          }
        ],
        "fixes": [
          "Исправлена ошибка в статусе похода на мини-карте Воздушного Дока.",
          "Исправлена аномальная анимация в интерфейсе получения предметов.",
          "Исправлены аномальные всплывающие данные при просмотре Радужного Моста на картах других сезонов.",
          "Исправлено неверное описание для оккупации зданий 6-го уровня во время этапа «Хроники Защиты Альвхейма - Непобедимые».",
          "Исправлена аномальная разметка текста во всплывающих окнах при просмотре точек сбора на картах других сезонов.",
          "Исправлено аномальное отображение в некоторых строках состояния сезона.",
          "Исправлено аномальное отображение строительства зданий Племени на некоторых картах сезона.",
          "Исправлено аномальное отображение количества Звериных Логовищ в «Территории Племени».",
          "Исправлено аномальное отображение в интерфейсе «Сопровождение Каравана».",
          "Исправлена проблема, при которой в пустующих позициях Племени в других Королевствах отображались местные игроки Племени.",
          "Исправлены некоторые проблемы отображения в «Blood Oath War».",
          "Исправлено аномальное отображение красной точки при переключении этапов в «Blood Oath War» при определенных обстоятельствах.",
          "Исправлено аномальное отображение очереди разведки в «Обзоре Отрядов».",
          "Исправлено аномальное отображение кнопки местоположения, когда рейтинг игрока не входит в квоту рейтинга.",
          "Исправлено аномальное отображение при покупке предметов в Лавке Божественных Самоцветов.",
          "Исправлена аномальная сортировка Мощи после ухода члена Племени с поста Ярла.",
          "Исправлено аномальное размещение закладок в «Битве Руин».",
          "Исправлено аномальное отображение в «Отчете Разведки».",
          "Исправлено аномальное отображение при быстром обмене предметов в «Зелье Духа Змеи».",
          "Исправлена аномальная подсказка при конвертации материалов в «Логове Дракона» при недостатке материалов.",
          "Исправлено аномальное отображение местного ландшафта на карте Экспедиции в Англию.",
          "Исправлена аномальная проблема с каналом чата после смены системного языка.",
          "Исправлено аномальное отображение имен лидеров Племени в Рейтинге Мощи Племени."
        ]
      }
    }
  },
  {
    "id": "update_17_12_2025",
    "meta": {
      "created_at": "2025-12-15T04:08:00Z",
      "start_timestamp": "2025-12-17T06:00:00+00:00",
      "display_time": "17. Dez 2025, 06:00 - 06:30 (UTC)",
      "title_en": "Update Dec 17",
      "title_de": "Update vom 17.12.",
      "title_cn": "12月17日更新",
      "title_ru": "Обновление 17 декабря"
    },
    "en": {
      "major": [
        "The Kingdom Mayhem Conquest Season [Surtr's Flames] is about to begin. Flames roar in Muspelheim!",
        "New Collaboration: Partnering with <How to Train Your Dragon>, let us embark on a Dragon Taming Journey!",
        "Christmas Event: Carriage racing event and newly designed Christmas Skins."
      ],
      "new_features": [
        "Added monthly card [Lightshade Journey] (activates Tribe Auto-Assist).",
        "Added a second Research queue (via Research Order Pack).",
        "Optimized [Quick Upgrade] for Hero Talents and added [Quick Upgrade] for skills.",
        "Added [Tribe Shop] - [Shard Market] to exchange Hero/Skill Shards.",
        "Added [2025 Hero Skin Choice Chest I] to Tribe Day Treasure Hunt.",
        "Added bulk donate function to Tribe Tech.",
        "Added [Add Friend] feature when viewing other players' Chief Profile.",
        "Added item quantity display bubbles in Inventory.",
        "Added a save draft function for Chat (stored locally).",
        "Added [Combat Settings] on mobile (Option to garrison after attacking)."
      ],
      "optimizations": [
        {
          "title": "Events & Returning",
          "items": [
            "Returning: 2024 Christmas series [Sparkling Holiday Night] set & [Snowy Deer's Shadow] flag."
          ]
        },
        {
          "title": "Blood Oath War",
          "items": [
            "Legions reduced from 3 to 1 in Midgard Championship.",
            "Garrisoned troops accumulate the same debuff as central buildings.",
            "Ranking rules optimized: Ties are decided by higher total kill points.",
            "Registration menu now clearly displays Legion member rules."
          ]
        },
        {
          "title": "UI & System",
          "items": [
            "Added coordinate sharing function (share spaces, buildings, cities, troops, monsters).",
            "Optimized display and performance of some pages.",
            "Optimized [Speedup Queue] menu organization (Training, Research, Healing, Forge).",
            "Optimized multi-troop selection logic for Marching.",
            "Optimized display for [Wheel of Fortune] & [Skill Wheel] + added notification text.",
            "Optimized interface for preset King's Decrees.",
            "Optimized [Mail] sorting/cleanup and extended expiration times.",
            "Optimized [Hall of Valor] interactions and performance.",
            "Optimized [Language Settings]: Split into System Language and Chat Translation Language.",
            "Optimized [Campaign] menu: Inactive events are hidden.",
            "Collector overview: Now displays bonuses from skins with unlock attributes.",
            "Optimized notification text after translating chat.",
            "Hero Skin unlocking: No longer gifts 10 corresponding shards."
          ]
        },
        {
          "title": "Rewards",
          "items": [
            "Conquest Season: Increased Recast Blades & adjusted Yggdrasil Dew distribution (Fenrir's Judgment, Hela's Curse, Baldr's Redemption, Alfheim's Defense)."
          ]
        }
      ],
      "fixes": [
        "Fixed an abnormal refresh issue in [Mail].",
        "Fixed display issue with [Campaign - Drill Ground] on PC.",
        "Fixed Hero Talents not taking effect in [Drill Ground].",
        "Fixed forge progress display issue in [Equipment Forge].",
        "Fixed avatar display issue when rallying neutral troops.",
        "Fixed medium checkpoints display in [Hela's Curse].",
        "Fixed text display issue in [Magic Card Blessing].",
        "Fixed damage progress display in [Sworn Vengeance] ranking.",
        "Fixed lag issue in [Magic Card Adventure].",
        "Fixed display issue in [Time-Limited Migration] searches."
      ]
    },
    "de": {
      "major": [
        "Die Königreich-Chaos Eroberungssaison [Surtrs Flammen] beginnt. Muspelheim brennt!",
        "Neue Kollaboration: Gemeinsam mit <Drachenzähmen leicht gemacht> auf Drachenjagd gehen!",
        "Weihnachts-Event: Kutschenrennen und neue Weihnachts-Skins."
      ],
      "new_features": [
        "Monatskarte [Lichtschatten-Reise] hinzugefügt (Aktiviert Stamm Auto-Assistenz).",
        "Zweite Forschungswarteschlange hinzugefügt (via Forschungsauftrag-Paket).",
        "Optimiertes [Schnell-Upgrade] für Talente und neu für Skills hinzugefügt.",
        "[Stamm-Shop] - [Splittermarkt] hinzugefügt (Tausch von Helden/Skill-Splittern).",
        "[2025 Helden-Skin-Auswahltruhe I] zur Stammestag-Schatzsuche hinzugefügt.",
        "Massenspende-Funktion für Stammestechnik hinzugefügt.",
        "[Freund hinzufügen] Funktion im Häuptlingsprofil ergänzt.",
        "Mengenanzeige-Bubbles im Inventar hinzugefügt.",
        "Entwurf-Speicherfunktion für den Chat hinzugefügt (lokal gespeichert).",
        "[Kampfeinstellungen] auf Mobile: Option zum Garnisonieren nach Angriff hinzugefügt."
      ],
      "optimizations": [
        {
          "title": "Events & Rückkehr",
          "items": [
            "Rückkehr: Weihnachts-Serie 2024 [Funkelnde Weihnachtsnacht] Set & [Schneehirsches Schatten] Flagge."
          ]
        },
        {
          "title": "Bluteid-Krieg (Optimiert)",
          "items": [
            "Legionen in der Midgard-Meisterschaft von 3 auf 1 reduziert.",
            "Garnisonstruppen sammeln nun denselben Debuff wie zentrale Gebäude.",
            "Ranglistenregeln optimiert: Bei Gleichstand entscheiden höhere Kill-Punkte.",
            "Anmeldemenü zeigt nun klar die Regeln für Legionsmitglieder."
          ]
        },
        {
          "title": "UI & System",
          "items": [
            "Koordinaten-Teilen Funktion hinzugefügt (für leere Flächen, Gebäude, Städte, Truppen, Monster).",
            "Anzeige und Performance einiger Seiten optimiert.",
            "[Beschleunigungs-Warteschlange] neu organisiert (Training, Forschung, Heilung, Schmiede).",
            "Multi-Truppen-Auswahl beim Marschieren optimiert.",
            "Anzeige für [Glücksrad] und [Skill-Rad] optimiert + Hinweistext.",
            "Interface für Königserlasse-Voreinstellungen optimiert.",
            "[Post]: Sortierung/Bereinigung optimiert, Ablaufzeit verlängert.",
            "[Halle der Tapferkeit]: Interaktionen und Performance verbessert.",
            "[Spracheinstellungen]: Unterteilt in System- und Chat-Übersetzungssprache.",
            "[Kampagne]: Inaktive Events werden im Menü ausgeblendet.",
            "Sammler-Übersicht: Zeigt nun Boni von Skins mit Freischalt-Attributen korrekt an.",
            "Hinweistext nach Chat-Übersetzung optimiert.",
            "Helden-Skin Freischaltung: Es werden keine 10 Splitter mehr geschenkt."
          ]
        },
        {
          "title": "Belohnungen",
          "items": [
            "Eroberungssaison: Mehr Umschmiede-Klingen & angepasste Menge an Yggdrasil-Tau (Fenrir, Hela, Baldr, Alfheim)."
          ]
        }
      ],
      "fixes": [
        "Refresh-Problem in der [Post] behoben.",
        "Anzeigefehler beim [Drill Ground] Eingang (PC Version) behoben.",
        "Fehler behoben, dass Heldentalente im [Drill Ground] nicht wirksam waren.",
        "Anzeigefehler beim Schmiedefortschritt in der [Ausrüstungsschmiede] behoben.",
        "Avatar-Anzeigefehler beim Sammeln neutraler Truppen behoben.",
        "Anzeigefehler bei mittleren Checkpoints in [Hela's Curse] behoben.",
        "Textanzeigefehler in [Magic Card Blessing] behoben.",
        "Schadensfortschritts-Anzeige im [Sworn Vengeance] Ranking behoben.",
        "Lag-Probleme im [Magic Card Adventure] behoben.",
        "Anzeigefehler bei der Suche nach Königreichen in [Zeitlich begrenzter Migration] behoben."
      ]
    },
    "cn": {
      "major": [
        "王国纷争征服赛季 [苏尔特尔的火焰] 即将开始。火焰在穆斯贝尔海姆咆哮！",
        "新联动：与《驯龙高手》合作，让我们踏上驯龙之旅！",
        "圣诞活动：马车竞速活动和全新设计的圣诞皮肤。"
      ],
      "new_features": [
        "新增月卡 [光影之旅]（激活部落自动协助）。",
        "新增第二条研究队列（通过研究令礼包）。",
        "优化英雄天赋的 [快速升级] 并新增技能的 [快速升级]。",
        "新增 [部落商店] - [碎片市场]，用于交换英雄/技能碎片。",
        "部落日寻宝新增 [2025英雄皮肤自选箱I]。",
        "部落科技新增批量捐赠功能。",
        "查看其他玩家首领资料时新增 [添加好友] 功能。",
        "背包中新增物品数量显示气泡。",
        "聊天新增草稿保存功能（本地存储）。",
        "移动端新增 [战斗设置]（攻击后驻防选项）。"
      ],
      "optimizations": [
        {
          "title": "活动与回归",
          "items": [
            "回归：2024圣诞系列 [璀璨假日之夜] 套装 & [雪鹿之影] 旗帜。"
          ]
        },
        {
          "title": "血誓之战",
          "items": [
            "米德加尔特锦标赛军团数量从3个减少到1个。",
            "驻防部队现在会累积与中心建筑相同的减益效果。",
            "排名规则优化：平局时由总击杀分较高者胜出。",
            "报名界面现在清晰显示军团成员规则。"
          ]
        },
        {
          "title": "界面与系统",
          "items": [
            "新增坐标分享功能（分享空地、建筑、城市、部队、怪物）。",
            "优化部分页面的显示和性能。",
            "优化 [加速队列] 菜单组织（训练、研究、治疗、锻造）。",
            "优化行军时的多部队选择逻辑。",
            "优化 [幸运转盘] & [技能转盘] 显示 + 新增提示文本。",
            "优化预设王令的界面。",
            "优化 [邮件] 排序/清理并延长过期时间。",
            "优化 [英灵殿] 交互和性能。",
            "优化 [语言设置]：拆分为系统语言和聊天翻译语言。",
            "优化 [战役] 菜单：非活动事件现在隐藏。",
            "收藏家概览：现在正确显示带有解锁属性的皮肤加成。",
            "优化聊天翻译后的提示文本。",
            "英雄皮肤解锁：不再赠送10个对应碎片。"
          ]
        },
        {
          "title": "奖励",
          "items": [
            "征服赛季：增加重铸之刃数量 & 调整尤克特拉希尔之露分布（芬里尔的审判、海拉的诅咒、巴德尔的救赎、亚尔夫海姆的防御）。"
          ]
        }
      ],
      "fixes": [
        "修复了 [邮件] 中的异常刷新问题。",
        "修复了PC端 [演武场] 的显示问题。",
        "修复了英雄天赋在 [演武场] 中不生效的问题。",
        "修复了 [装备锻造] 中的锻造进度显示问题。",
        "修复了集结中立部队时的头像显示问题。",
        "修复了 [海拉的诅咒] 中中级检查点的显示问题。",
        "修复了 [魔卡祝福] 中的文本显示问题。",
        "修复了 [血仇] 排名中的伤害进度显示问题。",
        "修复了 [魔卡冒险] 中的延迟问题。",
        "修复了 [限时迁城] 搜索中的显示问题。"
      ]
    },
    "ru": {
      "major": [
        "Сезон завоевания «Хаос Королевства» [Пламя Сурта] вот-вот начнется. Пламя ревет в Муспельхейме!",
        "Новая коллаборация: Партнерство с «Как приручить дракона», отправляемся в путешествие по приручению драконов!",
        "Рождественское событие: Гонки на повозках и новые рождественские скины."
      ],
      "new_features": [
        "Добавлена месячная карта [Путешествие света и тени] (активирует авто-помощь племени).",
        "Добавлена вторая очередь исследований (через пакет «Приказ об исследовании»).",
        "Оптимизировано [Быстрое улучшение] для талантов героев и добавлено для навыков.",
        "Добавлен [Магазин племени] - [Рынок осколков] для обмена осколков героев/навыков.",
        "В Охоту за сокровищами Дня племени добавлен [Сундук выбора скина героя 2025 I].",
        "Добавлена функция массового пожертвования в технологии племени.",
        "Добавлена функция [Добавить в друзья] при просмотре профиля вождя других игроков.",
        "Добавлены пузырьки с отображением количества предметов в инвентаре.",
        "Добавлена функция сохранения черновика для чата (хранится локально).",
        "Добавлены [Настройки боя] на мобильных (Опция гарнизона после атаки)."
      ],
      "optimizations": [
        {
          "title": "События и возвращение",
          "items": [
            "Возвращение: Рождественская серия 2024 набор [Сверкающая праздничная ночь] и флаг [Тень снежного оленя]."
          ]
        },
        {
          "title": "Война Клятвы Крови",
          "items": [
            "Количество легионов в Чемпионате Мидгарда сокращено с 3 до 1.",
            "Войска в гарнизоне теперь накапливают тот же дебафф, что и центральные здания.",
            "Оптимизированы правила рейтинга: при ничьей побеждает тот, у кого больше очков убийств.",
            "Меню регистрации теперь четко отображает правила для членов легиона."
          ]
        },
        {
          "title": "Интерфейс и система",
          "items": [
            "Добавлена функция обмена координатами (поделиться пустыми местами, зданиями, городами, войсками, монстрами).",
            "Оптимизировано отображение и производительность некоторых страниц.",
            "Оптимизирована организация меню [Очередь ускорений] (Тренировка, Исследование, Лечение, Ковка).",
            "Оптимизирована логика выбора нескольких отрядов при марше.",
            "Оптимизировано отображение для [Колеса Фортуны] и [Колеса Навыков] + добавлен текст уведомления.",
            "Оптимизирован интерфейс для предустановок Королевских указов.",
            "Оптимизирована сортировка/очистка [Почты] и продлено время истечения срока действия.",
            "Оптимизировано взаимодействие и производительность [Зала Доблести].",
            "Оптимизированы [Настройки языка]: Разделены на язык системы и язык перевода чата.",
            "Оптимизировано меню [Кампания]: неактивные события скрыты.",
            "Обзор коллекционера: Теперь корректно отображает бонусы от скинов с атрибутами разблокировки.",
            "Оптимизирован текст уведомления после перевода чата.",
            "Разблокировка скинов героев: Больше не дарится 10 соответствующих осколков."
          ]
        },
        {
          "title": "Награды",
          "items": [
            "Сезон завоевания: Увеличено количество Клинков перековки и скорректировано распределение Росы Иггдрасиля (Суд Фенрира, Проклятие Хелы, Искупление Бальдра, Оборона Альфхейма)."
          ]
        }
      ],
      "fixes": [
        "Исправлена проблема с аномальным обновлением в [Почте].",
        "Исправлена проблема отображения [Плаца] в Кампании на ПК.",
        "Исправлена ошибка, из-за которой таланты героя не действовали на [Плацу].",
        "Исправлена проблема отображения прогресса ковки в [Кузнице снаряжения].",
        "Исправлена проблема отображения аватара при сборе нейтральных войск.",
        "Исправлена проблема отображения средних контрольных точек в [Проклятии Хелы].",
        "Исправлена проблема отображения текста в [Благословении магических карт].",
        "Исправлена проблема отображения прогресса урона в рейтинге [Клятва мести].",
        "Исправлена проблема с лагами в [Приключении магических карт].",
        "Исправлена проблема отображения при поиске в [Миграции ограниченного времени]."
      ]
    }
  }
]