[
  {
    "id": "1455186438068109510",
    "meta": {
      "created_at": "2025-12-29T13:11:22.892000+00:00",
      "start_timestamp": "2023-11-19T06:00:00+00:00",
      "display_time": "19. Nov 2023",
      "title_en": "Update 19. Nov 2023",
      "title_de": "Update vom 19. Nov 2023",
      "title_cn": "更新 19. Nov 2023",
      "title_ru": "Обновление 19. Nov 2023",
      "image_url": ""
    },
    "en": {
      "data": {
        "major": [
          "Added the \"Drill Ground\" feature.",
          "Added SX heroes Sea's Embrace · Gloa and Crimson Arrow · Dalen.",
          "Added SX skills \"Raven of Death\", \"Rainbow Bridge Miracle\", and \"Fafnir's Riddle\"."
        ],
        "new_features": [
          "Added the \"Drill Ground\" feature. You can now customize hero combinations for duels and test your optimal hero lineup.",
          "Added SX heroes Sea's Embrace · Gloa and Crimson Arrow · Dalen. They will be available when the Kingdom reaches 813 days (Dalen) and 809 days (Gloa) respectively.",
          "Added SX skills \"Raven of Death\", \"Rainbow Bridge Miracle\", and \"Fafnir's Riddle\", which will be available when the Kingdom reaches 803 days.",
          "The \"2024 Thanksgiving\" event limited-time skin series returns.",
          "The \"Tribe Day Treasure Hunt\" choice chest has been replaced with the 2025 January~June skin choice chest.",
          "The Event Hub now has a \"Completed Events\" tab, automatically including events with all rewards claimed.",
          "Added \"Hero promotion\" feature, Hero Ivor can now be promoted to Legendary Hero."
        ],
        "optimizations": [
          {
            "title": "Core Gameplay & Interface",
            "items": [
              "Kingdom Might now calculates in real-time.",
              "Lowered the Battalion occupy achievement requirements for \"Alfheim's Defense\", reducing the number of Lv5 and Lv6 Lairs to be occupied simultaneously.",
              "Increased the weekly purchase limit for Blue Chalcedony and Recast Blade in the Prosperity Shop.",
              "Increased the weekly purchase limit for the Honing Fruit, Yggdrasil Dew, and Blue Chalcedony in the Prestige Shop. (valid during Conquest Season)",
              "Increased the weekly purchase limit for Blue Chalcedony, Yggdrasil Dew, and Honing Fruit in the clan shop (effective next refresh).",
              "Optimized the \"Trial of Courage\" Personal Conquest interface, adding tier and quantity recommendations",
              "Optimized the \"Sworn Vengeance\" interaction. When Tribe progress reaches the maximum, a secondary confirmation pop-up appears for repeated submissions",
              "Optimized the \"Hero Reclamation\" gameplay, supporting quick summon and claiming of current map rewards",
              "Optimized \"Blood Oath War\" & \"Battle of the Ruins\" gameplay",
              "Optimized \"Battle\" related functions",
              "Optimized \"Tribe\" feature",
              "Optimized player inner city operations",
              "Optimized \"Side Quest\" interaction, supporting quick reward claiming",
              "Optimized \"Daily Quest\" content. Added a new daily quest type: simply purchase a pack to earn 100 Activity Points and claim all daily rewards",
              "Optimized the display when \"Enemy Extermination\" Stage goals are achieved.",
              "Optimized \"mail\" function",
              "Optimized Arena matching rules, dispatched Troop max quantity now matches defender's league",
              "Optimized \"forge materials\" interface, the list of equipment available for forging can now be viewed",
              "Optimized \"Personal Might Ranking\" display, Tribe full name display removed",
              "Optimized \"Hero\" core ability display",
              "Optimized \"Hero Talent\" interface",
              "Optimized \"King's Decree\" tips, now triggers only the first time you become King",
              "Optimized \"City management\" interaction, interface now includes a 4-hour Shield item",
              "Optimized \"Brutal Fighter · Cecia\" voice lines"
            ]
          }
        ],
        "fixes": [
          "Fixed an error in the march status on the Air Dock minimap",
          "Fixed abnormal animation in the item acquisition interface",
          "Fixed abnormal pop-up data when viewing Rainbow Bridge in other season maps",
          "Fixed incorrect description for occupying Lv 6 buildings during the \"Alfheim's Defense\" Chronicles - Invincible stage",
          "Fixed abnormal text layout in pop-ups when viewing gathering points in other season maps",
          "Fixed abnormal display in some season status bars",
          "Fixed abnormal display of Tribe building construction in some season maps",
          "Fixed abnormal display of Beast Lair quantity in \"Tribe Territory\"",
          "Fixed abnormal display in the \"Escort Caravan\" interface",
          "Fixed an issue where vacant Tribe positions in other Kingdoms showed local Tribe players",
          "Fixed some display issues in \"Blood Oath War\"",
          "Fixed abnormal red dot display when switching stages in \"Blood Oath War\" under certain circumstances",
          "Fixed abnormal display of scout queue in \"Troop Overview\"",
          "Fixed abnormal display of the locate button when player ranking is not within the ranking quota",
          "Fixed abnormal display when purchasing items in the Divine Jewel Shop",
          "Fixed abnormal Might sorting after Tribe member resigns as Jarl",
          "Fixed abnormal bookmark placement in \"Battle of the Ruins\"",
          "Fixed abnormal display in the \"Scout Report\"",
          "Fixed abnormal display when quickly exchanging items in \"Serpent Spirit Potion\"",
          "Fixed abnormal prompt when converting materials in \"Dragon's Lair\" with insufficient materials",
          "Fixed abnormal display of local terrain in the Expedition to England map",
          "Fixed abnormal chat channel issue after switching system language",
          "Fixed abnormal display of Tribe Leader names in the Tribe Might Ranking"
        ]
      }
    },
    "de": {
      "data": {
        "major": [
          "Das \"Drill Ground\" Feature wurde hinzugefügt.",
          "SX-Helden Sea's Embrace · Gloa und Crimson Arrow · Dalen wurden hinzugefügt.",
          "SX-Fähigkeiten \"Raven of Death\", \"Rainbow Bridge Miracle\" und \"Fafnir's Riddle\" wurden hinzugefügt."
        ],
        "new_features": [
          "Das \"Drill Ground\" Feature wurde hinzugefügt. Sie können jetzt Heldenkombinationen für Duelle anpassen und Ihre optimale Heldenaufstellung testen.",
          "SX-Helden Sea's Embrace · Gloa und Crimson Arrow · Dalen wurden hinzugefügt. Sie werden verfügbar sein, wenn das Königreich 813 Tage (Dalen) bzw. 809 Tage (Gloa) erreicht.",
          "SX-Fähigkeiten \"Raven of Death\", \"Rainbow Bridge Miracle\" und \"Fafnir's Riddle\" wurden hinzugefügt, die verfügbar sein werden, wenn das Königreich 803 Tage erreicht.",
          "Die \"2024 Thanksgiving\" Event-Skin-Serie kehrt zurück.",
          "Die \"Tribe Day Treasure Hunt\"-Auswahlkiste wurde durch die Skin-Auswahlkiste für Januar-Juni 2025 ersetzt.",
          "Der Event Hub hat jetzt einen Reiter \"Abgeschlossene Events\", der automatisch Events mit allen beanspruchten Belohnungen auflistet.",
          "Das Feature \"Heldenbeförderung\" wurde hinzugefügt. Held Ivor kann jetzt zum Legendären Helden befördert werden."
        ],
        "optimizations": [
          {
            "title": "Kern-Gameplay & Benutzeroberfläche",
            "items": [
              "Königs-Macht wird jetzt in Echtzeit berechnet.",
              "Die Anforderungen für das Besetzen von Bataillonen für \"Alfheim's Defense\" wurden gesenkt, wodurch die Anzahl der gleichzeitig zu besetzenden Lairs der Stufe 5 und 6 reduziert wird.",
              "Das wöchentliche Kauf-Limit für Blaues Chalzedon und Umformungsklinge im Wohlstands-Shop wurde erhöht.",
              "Das wöchentliche Kauf-Limit für Honing Fruit, Yggdrasil Dew und Blaues Chalzedon im Prestige-Shop wurde erhöht. (gültig während der Eroberungs-Saison)",
              "Das wöchentliche Kauf-Limit für Blaues Chalzedon, Yggdrasil Dew und Honing Fruit im Clan-Shop wurde erhöht (wirksam beim nächsten Aktualisieren).",
              "Die Benutzeroberfläche des \"Trial of Courage\" Personal Conquest wurde optimiert und mit Empfehlungen für Stufen und Mengen ergänzt.",
              "Die Interaktion mit \"Sworn Vengeance\" wurde optimiert. Wenn der Stamm-Fortschritt das Maximum erreicht, erscheint ein sekundäres Bestätigungsfenster für wiederholte Einreichungen.",
              "Das Gameplay von \"Hero Reclamation\" wurde optimiert und unterstützt das schnelle Beschwören und Beanspruchen aktueller Kartenbelohnungen.",
              "Das Gameplay von \"Blood Oath War\" & \"Battle of the Ruins\" wurde optimiert.",
              "Mit \"Battle\" verwandte Funktionen wurden optimiert.",
              "Das \"Tribe\"-Feature wurde optimiert.",
              "Die Operationen der Spieler im inneren Stadtbereich wurden optimiert.",
              "Die Interaktion mit \"Side Quest\" wurde optimiert und unterstützt das schnelle Beanspruchen von Belohnungen.",
              "Der Inhalt von \"Daily Quest\" wurde optimiert. Ein neuer Typ von täglichen Quests wurde hinzugefügt: Kaufen Sie einfach ein Paket, um 100 Aktivitätspunkte zu erhalten und alle täglichen Belohnungen einzusammeln.",
              "Die Anzeige beim Erreichen von Zielen in \"Enemy Extermination\"-Stufen wurde optimiert.",
              "Die \"mail\"-Funktion wurde optimiert.",
              "Die Arena-Matching-Regeln wurden optimiert, die maximale Truppenmenge entspricht jetzt der Liga des Verteidigers.",
              "Die Benutzeroberfläche für \"forge materials\" wurde optimiert, die Liste der zum Schmieden verfügbaren Ausrüstungen kann jetzt eingesehen werden.",
              "Die Anzeige der \"Personal Might Ranking\" wurde optimiert, die Anzeige des vollständigen Stammesnamens wurde entfernt.",
              "Die Anzeige der Kernfähigkeiten von \"Hero\" wurde optimiert.",
              "Die Benutzeroberfläche von \"Hero Talent\" wurde optimiert.",
              "Die Tipps für \"King's Decree\" wurden optimiert und werden jetzt nur beim ersten Mal ausgelöst, wenn Sie König werden.",
              "Die Interaktion mit \"City management\" wurde optimiert, die Benutzeroberfläche enthält jetzt einen 4-Stunden-Schild-Gegenstand.",
              "Die Sprachausgabe von \"Brutal Fighter · Cecia\" wurde optimiert."
            ]
          }
        ],
        "fixes": [
          "Ein Fehler im Marschstatus auf der Minikarte des Air Dock wurde behoben.",
          "Abnormale Animationen in der Benutzeroberfläche für den Erwerb von Gegenständen wurden behoben.",
          "Abnormale Pop-up-Daten beim Betrachten der Regenbogenbrücke auf anderen Saisonkarten wurden behoben.",
          "Eine falsche Beschreibung für die Besetzung von Gebäuden der Stufe 6 während der \"Alfheim's Defense\"-Chronik - \"Unbesiegbar\"-Stufe wurde behoben.",
          "Abnormale Textplatzierung in Pop-ups beim Betrachten von Sammelpunkten auf anderen Saisonkarten wurde behoben.",
          "Abnormale Anzeige in einigen Saison-Statusleisten wurde behoben.",
          "Abnormale Anzeige des Stammgebäudebaus in einigen Saisonkarten wurde behoben.",
          "Abnormale Anzeige der Biesthöhlen-Menge in \"Tribe Territory\" wurde behoben.",
          "Abnormale Anzeige in der \"Escort Caravan\"-Benutzeroberfläche wurde behoben.",
          "Ein Problem, bei dem leere Stamm-Positionen in anderen Königreichen lokale Stammesspieler zeigten, wurde behoben.",
          "Einige Anzeigeprobleme in \"Blood Oath War\" wurden behoben.",
          "Abnormale Rotpunkt-Anzeige beim Wechseln von Stufen in \"Blood Oath War\" unter bestimmten Umständen wurde behoben.",
          "Abnormale Anzeige der Spähwarteschlange in \"Troop Overview\" wurde behoben.",
          "Abnormale Anzeige des Such-Buttons, wenn das Spieler-Ranking nicht innerhalb des Ranking-Kontingents liegt, wurde behoben.",
          "Abnormale Anzeige beim Kauf von Gegenständen im Divine Jewel Shop wurde behoben.",
          "Abnormale Macht-Sortierung nach dem Rücktritt eines Stammesmitglieds als Jarl wurde behoben.",
          "Abnormale Lesezeichenplatzierung in \"Battle of the Ruins\" wurde behoben.",
          "Abnormale Anzeige im \"Scout Report\" wurde behoben.",
          "Abnormale Anzeige beim schnellen Umtausch von Gegenständen in \"Serpent Spirit Potion\" wurde behoben.",
          "Abnormale Meldung beim Umwandeln von Materialien in \"Dragon's Lair\" mit unzureichenden Materialien wurde behoben.",
          "Abnormale Anzeige des lokalen Geländes auf der Karte Expedition nach England wurde behoben.",
          "Abnormale Chatkanal-Problem nach dem Wechseln der Systemsprache wurde behoben.",
          "Abnormale Anzeige von Stammesführer-Namen im Tribe Might Ranking wurde behoben."
        ]
      }
    },
    "cn": {
      "data": {
        "major": [
          "新增“训练场”功能。",
          "新增SX英雄沧海之拥·格洛亚和赤翎·达伦。",
          "新增SX技能“死亡乌鸦”、“虹桥奇迹”和“法布提的谜语”"
        ],
        "new_features": [
          "新增“训练场”功能。您现在可以自定义英雄组合进行决斗，并测试您的最佳英雄阵容。",
          "新增SX英雄沧海之拥·格洛亚和赤翎·达伦。他们将在王国达到813天（达伦）和809天（格洛亚）时可用。",
          "新增SX技能“死亡乌鸦”、“虹桥奇迹”和“法布提的谜语”，这些技能将在王国达到803天时可用。",
          "“2024感恩节”活动限定皮肤系列回归。",
          "“部落寻宝”选择宝箱已替换为2025年1月至6月皮肤选择宝箱。",
          "活动中心现新增“已完成活动”标签页，自动包含所有奖励已领取的活动。",
          "新增“英雄晋升”功能，英雄伊沃尔现可晋升为传奇英雄。"
        ],
        "optimizations": [
          {
            "title": "核心玩法与界面",
            "items": [
              "王国实力现可实时计算。",
              "降低了“阿尔夫海姆的守护”的军团占领成就要求，减少了需要同时占领的5级和6级巢穴数量。",
              "增加了繁荣商店中蓝玉和重铸之刃的每周购买上限。",
              "增加了声望商店中磨炼果实、约顿之露和蓝玉的每周购买上限。（征服赛季有效）",
              "增加了氏族商店中蓝玉、约顿之露和磨炼果实的每周购买上限（将于下次刷新时生效）。",
              "优化了“勇者试炼”个人征服界面，增加了等级和数量推荐。",
              "优化了“誓约复仇”互动。部落进度达到最大值时，会弹出二次确认弹窗以防止重复提交。",
              "优化了“英雄回收”玩法，支持快速召唤和领取当前地图奖励。",
              "优化了“Blood Oath War”和“Battle of the Ruins”玩法。",
              "优化了“战斗”相关功能。",
              "优化了“部落”功能。",
              "优化了玩家内城操作。",
              "优化了“支线任务”互动，支持快速领取奖励。",
              "优化了“日常任务”内容。新增了一种日常任务类型：只需购买礼包即可获得100活跃点并领取所有日常奖励。",
              "优化了“敌人驱逐”阶段目标达成时的显示。",
              "优化了“邮件”功能。",
              "优化了竞技场匹配规则，派遣部队的最大数量现在将与防御者的联赛匹配。",
              "优化了“锻造材料”界面，现在可以查看可锻造装备的列表。",
              "优化了“个人实力排行”显示，移除了部落全称显示。",
              "优化了“英雄”核心能力显示。",
              "优化了“英雄天赋”界面。",
              "优化了“国王诏令”提示，现在仅在您首次成为国王时触发。",
              "优化了“城市管理”互动，界面现在包含4小时护盾物品。",
              "优化了“狂战士·塞西娅”的语音台词。"
            ]
          }
        ],
        "fixes": [
          "修复了飞空艇码头小地图行军状态的错误。",
          "修复了物品获取界面动画异常。",
          "修复了在其他赛季地图中查看彩虹桥时弹出数据异常。",
          "修复了“阿尔夫海姆的守护”编年史-无敌阶段占领6级建筑时的错误描述。",
          "修复了在其他赛季地图中查看采集点时弹出文本布局异常。",
          "修复了某些赛季状态栏显示异常。",
          "修复了某些赛季地图中部落建筑建造显示异常。",
          "修复了“部落领地”中野兽巢穴数量显示异常。",
          "修复了“护送商队”界面显示异常。",
          "修复了在其他王国中出现的部落空缺职位显示为本地部落玩家的问题。",
          "修复了“Blood Oath War”中的一些显示问题。",
          "修复了在某些情况下，“Blood Oath War”下切换阶段时出现的红点显示异常。",
          "修复了“部队总览”中侦察队列显示异常。",
          "修复了玩家排名不在排名配额内时，定位按钮显示异常。",
          "修复了在神圣珠宝商店购买物品时显示异常。",
          "修复了部落成员辞去首领职位后，部落实力排序异常。",
          "修复了“Battle of the Ruins”中书签放置异常。",
          "修复了“侦察报告”显示异常。",
          "修复了在“蛇灵药剂”中快速兑换物品时显示异常。",
          "修复了在“龙穴”中材料不足时转换材料时提示异常。",
          "修复了英格兰远征地图中本地地形显示异常。",
          "修复了切换系统语言后聊天频道异常。",
          "修复了部落实力排行榜中部落首领名称显示异常。"
        ]
      }
    },
    "ru": {
      "data": {
        "major": [
          "Добавлена функция \"Дисциплинарный полигон\".",
          "Добавлены SX-герои Sea's Embrace · Gloa и Crimson Arrow · Dalen.",
          "Добавлены SX-навыки \"Raven of Death\", \"Rainbow Bridge Miracle\" и \"Fafnir's Riddle\"."
        ],
        "new_features": [
          "Добавлена функция \"Дисциплинарный полигон\". Теперь вы можете настраивать комбинации героев для поединков и тестировать свой оптимальный состав героев.",
          "Добавлены SX-герои Sea's Embrace · Gloa и Crimson Arrow · Dalen. Они будут доступны, когда Королевство достигнет 813 дней (Dalen) и 809 дней (Gloa) соответственно.",
          "Добавлены SX-навыки \"Raven of Death\", \"Rainbow Bridge Miracle\" и \"Fafnir's Riddle\", которые будут доступны, когда Королевство достигнет 803 дней.",
          "Возвращается серия ограниченных по времени скинов \"2024 Thanksgiving\".",
          "Сундук выбора \"Tribe Day Treasure Hunt\" был заменен на сундук выбора скинов за январь-июнь 2025 года.",
          "На вкладке \"Completed Events\" в Центре Событий теперь автоматически отображаются события, по которым получены все награды.",
          "Добавлена функция \"Hero promotion\". Герой Ivor теперь может быть повышен до Легендарного Героя."
        ],
        "optimizations": [
          {
            "title": "Core Gameplay & Interface",
            "items": [
              "Сила Королевства теперь рассчитывается в реальном времени.",
              "Снижены требования к достижениям по оккупации батальона для \"Alfheim's Defense\", уменьшено количество Логов 5-го и 6-го уровня, которые необходимо оккупировать одновременно.",
              "Увеличен еженедельный лимит покупок Blue Chalcedony и Recast Blade в Prosperity Shop.",
              "Увеличен еженедельный лимит покупок Honing Fruit, Yggdrasil Dew и Blue Chalcedony в Prestige Shop. (действительно в течение Сезона Завоевания)",
              "Увеличен еженедельный лимит покупок Blue Chalcedony, Yggdrasil Dew и Honing Fruit в клановом магазине (вступает в силу при следующем обновлении).",
              "Оптимизирован интерфейс \"Trial of Courage\" Personal Conquest, добавлены рекомендации по уровням и количеству",
              "Оптимизировано взаимодействие \"Sworn Vengeance\". Когда прогресс Племени достигает максимума, появляется вторичное всплывающее окно подтверждения для повторных отправлений",
              "Оптимизирован игровой процесс \"Hero Reclamation\", поддерживается быстрая телепортация и получение текущих наград карты",
              "Оптимизирован игровой процесс \"Blood Oath War\" & \"Battle of the Ruins\"",
              "Оптимизированы функции, связанные с \"Battle\"",
              "Оптимизирована функция \"Tribe\"",
              "Оптимизированы внутригородские операции игрока",
              "Оптимизировано взаимодействие \"Side Quest\", поддерживается быстрое получение наград",
              "Оптимизировано содержимое \"Daily Quest\". Добавлен новый тип ежедневного задания: просто купите набор, чтобы заработать 100 очков активности и получить все ежедневные награды",
              "Оптимизировано отображение при достижении целей этапа \"Enemy Extermination\".",
              "Оптимизирована функция \"mail\"",
              "Оптимизированы правила подбора противников на Арене, максимальное количество отправленных отрядов теперь соответствует лиге защитника",
              "Оптимизирован интерфейс \"forge materials\", теперь можно просмотреть список доступного для ковки снаряжения",
              "Оптимизировано отображение \"Personal Might Ranking\", отображение полного названия племени удалено",
              "Оптимизировано отображение основных способностей \"Hero\"",
              "Оптимизирован интерфейс \"Hero Talent\"",
              "Оптимизированы подсказки \"King's Decree\", теперь они срабатывают только при первом становлении Королем",
              "Оптимизировано взаимодействие \"City management\", интерфейс теперь включает 4-часовой щит",
              "Оптимизированы голосовые реплики \"Brutal Fighter · Cecia\""
            ]
          }
        ],
        "fixes": [
          "Исправлена ошибка в статусе марша на миникарте Air Dock",
          "Исправлена аномальная анимация в интерфейсе получения предметов",
          "Исправлены аномальные всплывающие данные при просмотре Rainbow Bridge на других сезонных картах",
          "Исправлено неверное описание оккупации зданий 6-го уровня во время этапа \"Alfheim's Defense\" Chronicles - Invincible",
          "Исправлена аномальная компоновка текста во всплывающих окнах при просмотре точек сбора на других сезонных картах",
          "Исправлено аномальное отображение в некоторых статусных строках сезонов",
          "Исправлено аномальное отображение строительства зданий Племени на некоторых сезонных картах",
          "Исправлено аномальное отображение количества Логов Зверей в \"Tribe Territory\"",
          "Исправлено аномальное отображение в интерфейсе \"Escort Caravan\"",
          "Исправлена проблема, из-за которой пустые позиции Племени в других Королевствах отображали местных игроков Племени",
          "Исправлены некоторые проблемы с отображением в \"Blood Oath War\"",
          "Исправлено аномальное отображение красной точки при смене этапов в \"Blood Oath War\" при определенных обстоятельствах",
          "Исправлено аномальное отображение очереди разведки в \"Troop Overview\"",
          "Исправлено аномальное отображение кнопки поиска, когда рейтинг игрока не входит в квоту",
          "Исправлено аномальное отображение при покупке предметов в Divine Jewel Shop",
          "Исправлена аномальная сортировка силы после того, как член Племени уходит с поста Ярла",
          "Исправлено аномальное размещение закладок в \"Battle of the Ruins\"",
          "Исправлено аномальное отображение в \"Scout Report\"",
          "Исправлено аномальное отображение при быстром обмене предметов в \"Serpent Spirit Potion\"",
          "Исправлена аномальная подсказка при преобразовании материалов в \"Dragon's Lair\" с недостаточным количеством материалов",
          "Исправлено аномальное отображение местного ландшафта на карте Expedition to England",
          "Исправлена проблема с аномальным каналом чата после смены системного языка",
          "Исправлено аномальное отображение имен Лидеров Племени в \"Tribe Might Ranking\""
        ]
      }
    }
  },
  {
    "id": "update_17_12_2025",
    "meta": {
      "created_at": "2025-12-15T04:08:00Z",
      "start_timestamp": "2025-12-17T06:00:00+00:00",
      "display_time": "17. Dez, 06:00 - 06:30 (UTC)",
      "title_en": "Update Dec 17",
      "title_de": "Update vom 17.12.",
      "title_cn": "12月17日更新",
      "title_ru": "Обновление 17 декабря"
    },
    "en": {
      "major": [
        "The Kingdom Mayhem Conquest Season [Surtr's Flames] is about to begin. Flames roar in Muspelheim!",
        "New Collaboration: Partnering with <How to Train Your Dragon>, let us embark on a Dragon Taming Journey!",
        "Christmas Event: Carriage racing event and newly designed Christmas Skins."
      ],
      "new_features": [
        "Added monthly card [Lightshade Journey] (activates Tribe Auto-Assist).",
        "Added a second Research queue (via Research Order Pack).",
        "Optimized [Quick Upgrade] for Hero Talents and added [Quick Upgrade] for skills.",
        "Added [Tribe Shop] - [Shard Market] to exchange Hero/Skill Shards.",
        "Added [2025 Hero Skin Choice Chest I] to Tribe Day Treasure Hunt.",
        "Added bulk donate function to Tribe Tech.",
        "Added [Add Friend] feature when viewing other players' Chief Profile.",
        "Added item quantity display bubbles in Inventory.",
        "Added a save draft function for Chat (stored locally).",
        "Added [Combat Settings] on mobile (Option to garrison after attacking)."
      ],
      "optimizations": [
        {
          "title": "Events & Returning",
          "items": [
            "Returning: 2024 Christmas series [Sparkling Holiday Night] set & [Snowy Deer's Shadow] flag."
          ]
        },
        {
          "title": "Blood Oath War",
          "items": [
            "Legions reduced from 3 to 1 in Midgard Championship.",
            "Garrisoned troops accumulate the same debuff as central buildings.",
            "Ranking rules optimized: Ties are decided by higher total kill points.",
            "Registration menu now clearly displays Legion member rules."
          ]
        },
        {
          "title": "UI & System",
          "items": [
            "Added coordinate sharing function (share spaces, buildings, cities, troops, monsters).",
            "Optimized display and performance of some pages.",
            "Optimized [Speedup Queue] menu organization (Training, Research, Healing, Forge).",
            "Optimized multi-troop selection logic for Marching.",
            "Optimized display for [Wheel of Fortune] & [Skill Wheel] + added notification text.",
            "Optimized interface for preset King's Decrees.",
            "Optimized [Mail] sorting/cleanup and extended expiration times.",
            "Optimized [Hall of Valor] interactions and performance.",
            "Optimized [Language Settings]: Split into System Language and Chat Translation Language.",
            "Optimized [Campaign] menu: Inactive events are hidden.",
            "Collector overview: Now displays bonuses from skins with unlock attributes.",
            "Optimized notification text after translating chat.",
            "Hero Skin unlocking: No longer gifts 10 corresponding shards."
          ]
        },
        {
          "title": "Rewards",
          "items": [
            "Conquest Season: Increased Recast Blades & adjusted Yggdrasil Dew distribution (Fenrir's Judgment, Hela's Curse, Baldr's Redemption, Alfheim's Defense)."
          ]
        }
      ],
      "fixes": [
        "Fixed an abnormal refresh issue in [Mail].",
        "Fixed display issue with [Campaign - Drill Ground] on PC.",
        "Fixed Hero Talents not taking effect in [Drill Ground].",
        "Fixed forge progress display issue in [Equipment Forge].",
        "Fixed avatar display issue when rallying neutral troops.",
        "Fixed medium checkpoints display in [Hela's Curse].",
        "Fixed text display issue in [Magic Card Blessing].",
        "Fixed damage progress display in [Sworn Vengeance] ranking.",
        "Fixed lag issue in [Magic Card Adventure].",
        "Fixed display issue in [Time-Limited Migration] searches."
      ]
    },
    "de": {
      "major": [
        "Die Königreich-Chaos Eroberungssaison [Surtrs Flammen] beginnt. Muspelheim brennt!",
        "Neue Kollaboration: Gemeinsam mit <Drachenzähmen leicht gemacht> auf Drachenjagd gehen!",
        "Weihnachts-Event: Kutschenrennen und neue Weihnachts-Skins."
      ],
      "new_features": [
        "Monatskarte [Lichtschatten-Reise] hinzugefügt (Aktiviert Stamm Auto-Assistenz).",
        "Zweite Forschungswarteschlange hinzugefügt (via Forschungsauftrag-Paket).",
        "Optimiertes [Schnell-Upgrade] für Talente und neu für Skills hinzugefügt.",
        "[Stamm-Shop] - [Splittermarkt] hinzugefügt (Tausch von Helden/Skill-Splittern).",
        "[2025 Helden-Skin-Auswahltruhe I] zur Stammestag-Schatzsuche hinzugefügt.",
        "Massenspende-Funktion für Stammestechnik hinzugefügt.",
        "[Freund hinzufügen] Funktion im Häuptlingsprofil ergänzt.",
        "Mengenanzeige-Bubbles im Inventar hinzugefügt.",
        "Entwurf-Speicherfunktion für den Chat hinzugefügt (lokal gespeichert).",
        "[Kampfeinstellungen] auf Mobile: Option zum Garnisonieren nach Angriff hinzugefügt."
      ],
      "optimizations": [
        {
          "title": "Events & Rückkehr",
          "items": [
            "Rückkehr: Weihnachts-Serie 2024 [Funkelnde Weihnachtsnacht] Set & [Schneehirsches Schatten] Flagge."
          ]
        },
        {
          "title": "Bluteid-Krieg (Optimiert)",
          "items": [
            "Legionen in der Midgard-Meisterschaft von 3 auf 1 reduziert.",
            "Garnisonstruppen sammeln nun denselben Debuff wie zentrale Gebäude.",
            "Ranglistenregeln optimiert: Bei Gleichstand entscheiden höhere Kill-Punkte.",
            "Anmeldemenü zeigt nun klar die Regeln für Legionsmitglieder."
          ]
        },
        {
          "title": "UI & System",
          "items": [
            "Koordinaten-Teilen Funktion hinzugefügt (für leere Flächen, Gebäude, Städte, Truppen, Monster).",
            "Anzeige und Performance einiger Seiten optimiert.",
            "[Beschleunigungs-Warteschlange] neu organisiert (Training, Forschung, Heilung, Schmiede).",
            "Multi-Truppen-Auswahl beim Marschieren optimiert.",
            "Anzeige für [Glücksrad] und [Skill-Rad] optimiert + Hinweistext.",
            "Interface für Königserlasse-Voreinstellungen optimiert.",
            "[Post]: Sortierung/Bereinigung optimiert, Ablaufzeit verlängert.",
            "[Halle der Tapferkeit]: Interaktionen und Performance verbessert.",
            "[Spracheinstellungen]: Unterteilt in System- und Chat-Übersetzungssprache.",
            "[Kampagne]: Inaktive Events werden im Menü ausgeblendet.",
            "Sammler-Übersicht: Zeigt nun Boni von Skins mit Freischalt-Attributen korrekt an.",
            "Hinweistext nach Chat-Übersetzung optimiert.",
            "Helden-Skin Freischaltung: Es werden keine 10 Splitter mehr geschenkt."
          ]
        },
        {
          "title": "Belohnungen",
          "items": [
            "Eroberungssaison: Mehr Umschmiede-Klingen & angepasste Menge an Yggdrasil-Tau (Fenrir, Hela, Baldr, Alfheim)."
          ]
        }
      ],
      "fixes": [
        "Refresh-Problem in der [Post] behoben.",
        "Anzeigefehler beim [Drill Ground] Eingang (PC Version) behoben.",
        "Fehler behoben, dass Heldentalente im [Drill Ground] nicht wirksam waren.",
        "Anzeigefehler beim Schmiedefortschritt in der [Ausrüstungsschmiede] behoben.",
        "Avatar-Anzeigefehler beim Sammeln neutraler Truppen behoben.",
        "Anzeigefehler bei mittleren Checkpoints in [Hela's Curse] behoben.",
        "Textanzeigefehler in [Magic Card Blessing] behoben.",
        "Schadensfortschritts-Anzeige im [Sworn Vengeance] Ranking behoben.",
        "Lag-Probleme im [Magic Card Adventure] behoben.",
        "Anzeigefehler bei der Suche nach Königreichen in [Zeitlich begrenzter Migration] behoben."
      ]
    },
    "cn": {
      "major": [
        "王国纷争征服赛季 [苏尔特尔的火焰] 即将开始。火焰在穆斯贝尔海姆咆哮！",
        "新联动：与《驯龙高手》合作，让我们踏上驯龙之旅！",
        "圣诞活动：马车竞速活动和全新设计的圣诞皮肤。"
      ],
      "new_features": [
        "新增月卡 [光影之旅]（激活部落自动协助）。",
        "新增第二条研究队列（通过研究令礼包）。",
        "优化英雄天赋的 [快速升级] 并新增技能的 [快速升级]。",
        "新增 [部落商店] - [碎片市场]，用于交换英雄/技能碎片。",
        "部落日寻宝新增 [2025英雄皮肤自选箱I]。",
        "部落科技新增批量捐赠功能。",
        "查看其他玩家首领资料时新增 [添加好友] 功能。",
        "背包中新增物品数量显示气泡。",
        "聊天新增草稿保存功能（本地存储）。",
        "移动端新增 [战斗设置]（攻击后驻防选项）。"
      ],
      "optimizations": [
        {
          "title": "活动与回归",
          "items": [
            "回归：2024圣诞系列 [璀璨假日之夜] 套装 & [雪鹿之影] 旗帜。"
          ]
        },
        {
          "title": "血誓之战",
          "items": [
            "米德加尔特锦标赛军团数量从3个减少到1个。",
            "驻防部队现在会累积与中心建筑相同的减益效果。",
            "排名规则优化：平局时由总击杀分较高者胜出。",
            "报名界面现在清晰显示军团成员规则。"
          ]
        },
        {
          "title": "界面与系统",
          "items": [
            "新增坐标分享功能（分享空地、建筑、城市、部队、怪物）。",
            "优化部分页面的显示和性能。",
            "优化 [加速队列] 菜单组织（训练、研究、治疗、锻造）。",
            "优化行军时的多部队选择逻辑。",
            "优化 [幸运转盘] & [技能转盘] 显示 + 新增提示文本。",
            "优化预设王令的界面。",
            "优化 [邮件] 排序/清理并延长过期时间。",
            "优化 [英灵殿] 交互和性能。",
            "优化 [语言设置]：拆分为系统语言和聊天翻译语言。",
            "优化 [战役] 菜单：非活动事件现在隐藏。",
            "收藏家概览：现在正确显示带有解锁属性的皮肤加成。",
            "优化聊天翻译后的提示文本。",
            "英雄皮肤解锁：不再赠送10个对应碎片。"
          ]
        },
        {
          "title": "奖励",
          "items": [
            "征服赛季：增加重铸之刃数量 & 调整尤克特拉希尔之露分布（芬里尔的审判、海拉的诅咒、巴德尔的救赎、亚尔夫海姆的防御）。"
          ]
        }
      ],
      "fixes": [
        "修复了 [邮件] 中的异常刷新问题。",
        "修复了PC端 [演武场] 的显示问题。",
        "修复了英雄天赋在 [演武场] 中不生效的问题。",
        "修复了 [装备锻造] 中的锻造进度显示问题。",
        "修复了集结中立部队时的头像显示问题。",
        "修复了 [海拉的诅咒] 中中级检查点的显示问题。",
        "修复了 [魔卡祝福] 中的文本显示问题。",
        "修复了 [血仇] 排名中的伤害进度显示问题。",
        "修复了 [魔卡冒险] 中的延迟问题。",
        "修复了 [限时迁城] 搜索中的显示问题。"
      ]
    },
    "ru": {
      "major": [
        "Сезон завоевания «Хаос Королевства» [Пламя Сурта] вот-вот начнется. Пламя ревет в Муспельхейме!",
        "Новая коллаборация: Партнерство с «Как приручить дракона», отправляемся в путешествие по приручению драконов!",
        "Рождественское событие: Гонки на повозках и новые рождественские скины."
      ],
      "new_features": [
        "Добавлена месячная карта [Путешествие света и тени] (активирует авто-помощь племени).",
        "Добавлена вторая очередь исследований (через пакет «Приказ об исследовании»).",
        "Оптимизировано [Быстрое улучшение] для талантов героев и добавлено для навыков.",
        "Добавлен [Магазин племени] - [Рынок осколков] для обмена осколков героев/навыков.",
        "В Охоту за сокровищами Дня племени добавлен [Сундук выбора скина героя 2025 I].",
        "Добавлена функция массового пожертвования в технологии племени.",
        "Добавлена функция [Добавить в друзья] при просмотре профиля вождя других игроков.",
        "Добавлены пузырьки с отображением количества предметов в инвентаре.",
        "Добавлена функция сохранения черновика для чата (хранится локально).",
        "Добавлены [Настройки боя] на мобильных (Опция гарнизона после атаки)."
      ],
      "optimizations": [
        {
          "title": "События и возвращение",
          "items": [
            "Возвращение: Рождественская серия 2024 набор [Сверкающая праздничная ночь] и флаг [Тень снежного оленя]."
          ]
        },
        {
          "title": "Война Клятвы Крови",
          "items": [
            "Количество легионов в Чемпионате Мидгарда сокращено с 3 до 1.",
            "Войска в гарнизоне теперь накапливают тот же дебафф, что и центральные здания.",
            "Оптимизированы правила рейтинга: при ничьей побеждает тот, у кого больше очков убийств.",
            "Меню регистрации теперь четко отображает правила для членов легиона."
          ]
        },
        {
          "title": "Интерфейс и система",
          "items": [
            "Добавлена функция обмена координатами (поделиться пустыми местами, зданиями, городами, войсками, монстрами).",
            "Оптимизировано отображение и производительность некоторых страниц.",
            "Оптимизирована организация меню [Очередь ускорений] (Тренировка, Исследование, Лечение, Ковка).",
            "Оптимизирована логика выбора нескольких отрядов при марше.",
            "Оптимизировано отображение для [Колеса Фортуны] и [Колеса Навыков] + добавлен текст уведомления.",
            "Оптимизирован интерфейс для предустановок Королевских указов.",
            "Оптимизирована сортировка/очистка [Почты] и продлено время истечения срока действия.",
            "Оптимизировано взаимодействие и производительность [Зала Доблести].",
            "Оптимизированы [Настройки языка]: Разделены на язык системы и язык перевода чата.",
            "Оптимизировано меню [Кампания]: неактивные события скрыты.",
            "Обзор коллекционера: Теперь корректно отображает бонусы от скинов с атрибутами разблокировки.",
            "Оптимизирован текст уведомления после перевода чата.",
            "Разблокировка скинов героев: Больше не дарится 10 соответствующих осколков."
          ]
        },
        {
          "title": "Награды",
          "items": [
            "Сезон завоевания: Увеличено количество Клинков перековки и скорректировано распределение Росы Иггдрасиля (Суд Фенрира, Проклятие Хелы, Искупление Бальдра, Оборона Альфхейма)."
          ]
        }
      ],
      "fixes": [
        "Исправлена проблема с аномальным обновлением в [Почте].",
        "Исправлена проблема отображения [Плаца] в Кампании на ПК.",
        "Исправлена ошибка, из-за которой таланты героя не действовали на [Плацу].",
        "Исправлена проблема отображения прогресса ковки в [Кузнице снаряжения].",
        "Исправлена проблема отображения аватара при сборе нейтральных войск.",
        "Исправлена проблема отображения средних контрольных точек в [Проклятии Хелы].",
        "Исправлена проблема отображения текста в [Благословении магических карт].",
        "Исправлена проблема отображения прогресса урона в рейтинге [Клятва мести].",
        "Исправлена проблема с лагами в [Приключении магических карт].",
        "Исправлена проблема отображения при поиске в [Миграции ограниченного времени]."
      ]
    }
  }
]